//여러 이벤트들이 있는 소스코드


#include "헤더.h"



void event_donut(player* a) //[0]도넛가게이벤트
{
	PlaySound(TEXT("event_donut.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//도넛가게 배경음악 출력
	system("cls");
	sys_printstat(a);//캐릭터 스탯창 표시
	Sleep(2000);

	srand((int)time(NULL));
	int sel_1 = 0;
	printf("                       .^!JPPPPPPJ777Y55Y5P5?!:.\n");
	printf("                     :!JJ7YPP5Y5G5YYYYJ?77JBJJYJ~.\n");
	printf("                    75Y7!7P??PP5YJ??555G???557!?YY!:::^^^^^^^^^^^:::::::.\n");
	printf("                   ^5GYJJYJ77PPGY??JYP55J55YY55555PBY^^^^^^^^^^^^^^^^^^^^^^::::.\n");
	printf("                 ~GB7!7YY5?JPP5??5P5PJ??Y5Y5PJ5GPPPB5^^^^^^^^^^^^^^^^^^^^^^^^^^:::.\n");
	printf("                 ^P?5Y?YGYGJ?JJ???J555J????JJ?J5PPGBYY5^^^^^^^^^^^^^^^^^^^^^^^^^^^^^:::..\n");
	printf("                JY^~PY?YYJ?JJJJ5Y?7!7J55????PPGYJGY!!P7:^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^::.\n");
	printf("                :P!!?GJJY?JYYJJP7^:::::^JP??5GPPYJ5P?!J5:^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^::..\n");
	printf("                ^GY5YGPPGP5GPGGY:^^^^^^:^GJ??Y5YJJJ5PP55:^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^:...\n");
	printf("                :PB77JYJYJ??JJJP7^:::::^?P??Y55YJJYGPB#Y^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^::......\n");
	printf("                 JB5YYJ????J???J5Y?777JPB5YYGPPPP5P5555YJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJ5!.:!!:\n");
	printf("                 :PJ7?YPJ?PGPP5??JYYJJJYPPG5JY55PGP~!?YYYYY?7?YYYYY?JYYY?YYYYYY?JYYYYYYYYYJYYYY?7P?.!GG~\n");
	printf("                   ^P?~~557JY5PP??5PPY??JY5555YJJG5P~7GJJ5YJPPPJY5YJPBY?5GP?GB?5PGJJB5Y?Y5G5?55GY7P?::::\n");
	printf("                  :~YY!P?7???????JY5YYYYP5YYPYJJPGP~7G?JBG??BJ?GYG7YBJ?JJY7GG75PG??GYG75P55JYYPY7P?:^:\n");
	printf("                 :^^^75GPYJJY5Y55JJJJYYY5PPP5YY5GGP~7G?JP5?5G5?55Y?PBJJB5??GBJJ55?YGJG75P5P557YG?P?:^^:\n");
	printf("                ^7^^^:^!YPPY?!!!YPYJJJ5GJ!!!?YPPJJP~755YYY5Y?J5YYY5YY555Y5Y5JYYYY55??5Y5YJYYY55J7P?:^^^:\n");
	printf("               :7PBY!^^^::^!?JJJ?7YPPPPPJ??JJJ?!^:7G?JJYYYYJJJJJYYYJJJYYJJYYJJJYYYYJJJJYJJJJYYYJJJG?:^^^^:\n");
	printf("               :^7Y~^^^^^^:::^~!!77PP5GY77!~^^::^^^!!!!!!!!!7B555BY!!!!!!!!!!!!!!!!JGY5PB?!!!!!!!!!~^^^^^^.\n");
	printf("              :^^^^^^^^^~5YYYYJJJJPP5P5JJYYYYYYYYYYYYYYYYYYYGPPPG5YYYYYYYYYYYYYYYY5GPPPG5YYYY5J:::^^^^^^^:\n");
	printf("              :^^^^^^^^^^!GJ?JYY555555555555555555555555555P5555555PPPPPPPPPPPPPPPGPPPPPPPGGGPGP^^^^^^^^^^^:.\n");
	printf("             :^^^^^^^^^^!G?J5PPPPPP55P55555555P55555555555555555555P55PPPPPPPPPPPPPPPPPPPPPPPGP^^^^^^^^^^^:.\n");
	printf("             :^^^^^^^^^^~P5PPPPPPPPPPPPPPPPPG5PPPPPPGPPPPPPPGP5PPPPPGGPPPPPPGGPPPPPPPGPPPPPPPG5^^^^^^^^^^^:.\n");
	printf("             ~GB5^^JJ^^:::!GJP!^^^^~5GYJ???J5BJ~^^^^7GPJ????JGP!^^^^~YGYJ???J5BY~^^^^7GPJ????JP7!Y7:!BBY^^^.\n");
	printf("             YBB5J5BB7:7?~~G!?5YJJY5YJ55555P5JY5YJJ55JY555555YJ5YJJY5YJ5555555JY5YJJY5JY5555PG7:5BGYJPBG7::\n");
	printf("             7?!^PGP55YGB7~G!!??JJJ?777??????77??JJ???7??JYYYJJJYY5YYJJJYYYYYJJJJYYYYYYJJJJ5BGPY55GGJ^7J!^:\n");
	printf("             :^^^^^^^^^^~P5PPPPPPPPPPPPPPPPPG5PPPPPPGPPPPPPPGP5PPPPPGGPPPPPPGGPPPPPPPGPPPPPPPG5^^^^^^^^^^^:\n");
	printf("              ::^!~^YBGGGPPG!!?????YYYYYYYYYYYYYYY??????7?GYYYYYYYYYYYJ????JYY??JYYYYYG5JJJYBGGGG!^!~^::^^:\n");
	printf("              :::::~P5JPGBBG!!?????GJ?????!~~!?~7G??????7JGJ?????????7!!!!7??!!!??????G5JJJYBG5JPY^:::::^:.\n");
	printf("            .~7?7!^P5?JYYY5G!!?????G?!!!!!^:^!^:?G???????JG777777777~^^^^!7!^^~7777777P5JJJYGYJ??G?^!??7~.\n");
	printf("            J5JJY55GYJ??JYGG!!?????G?!!!!^^^!!^!JG???????JG7!!!!!!!~^^^~!7~^^!7!!!!!!!P5JJJYGJ??JPG5YYJJP!\n");
	printf("           7P7????JYPPYJY?YG!!?????G?!!7~^^~!^~?YG???????JG7!!!!!!~~~~~!!~~~!7!!!!!!!!P5JJJYGYJ5P5J??????G:.\n");
	printf("           7P7J??J???JPPPJYG!!?????GYY7!~~~!~~7?JG???????JG7!!!!!~~~~!!!~~!!!!!!!!!!!!P5JJJYBGP5J??JJ????G:\n");
	printf("           YY???JYJJ??YPP5G!!?????GYJ7~~~!!~7??JG???????JG7!!!!!!!!!!!~~!!!!!!!!!!!!!P5JJJYB5J??JJJJ???P7.\n");
	printf("      ^!77!!55J??JY5J??J5GG!!?????G?!!~~!!~7???JG???????JG7!!!!!!!!!!!!!!!!!!!!!!!!!!P5JJJYG???J5Y???YPJ!777~: \n");
	printf("      ~PJYYYYYPP5J??JYYJ??5G!!?????G?!!!!7!7????JG??????7?G7!!!!!!!!!!!!!!!!!!!!!!!!!!P5JJJYG?JYYJ??Y5P5YYYYYY5:\n");
	printf("      7G!?J?JJ?JYP5Y?JYYJJYG!!?????G?!!7????????JG?????7J5PJJJJJJJJJJJJJJJJJJJJJJJJJJJ5PYJJYGYYY?JYPPY??J??J7?G:\n\n");

	sys_print("길을 걸어가다가 데헤아의 도넛 가게를 발견했다.\n");
	sys_print("갓 구운 도넛 하나에 20골드!\n");
	sys_print("너무 배가 고프다... 어떻게 하지...?\n");
	sys_print("\n[1]훔친다\t[2]사먹는다\t[3]굶는다\n");
	Sleep(100);
	sel_1 = sys_select();

	switch (sel_1) {
	case 1://훔칠 경우
		if (((rand() % 5) + (a->dex)) > 10)//캐릭터 민첩과 랜덤으로 뽑은 값의 합이 10을 넘을 경우(훔치기 성공)
		{
			sys_printdot();
			sys_print("성공!!\n");
			sys_print("휴...살았다..\n");
			sys_print("...웩\n");
			sys_print("이거, 상한 건 아니겠지?\n");
			sys_print("훔친 도넛을 먹고 체력이 1 증가했다!\n");
			a->hp += 1;//도넛을 먹고 체력 1 회복
		}
		else//훔치기 실패했을 경우
		{
			sys_printdot();
			printf("빵집 점장 : ");
			sys_print("거기 지금 뭐 하는거야!!\n");
			sys_print("(큰일났다!!)\n");
			printf("빵집 점장 : ");
			sys_print("거기 서 !!!!!\n");
			sys_printdot();
			sys_print("열심히 도망갔지만 금방 잡혀 실컷 두드려맞았다..으으\n");
			sys_print("너무 많이 맞아서 체력이 3 감소했다....\n");
			a->hp -= 3;//빵집 점장에게 맞아서 체력 3 감소
		}
		break;

	case 2://사먹을 경우
		sys_print("20골드를 지불하고 도넛을 사먹었다\n");
		sys_print("도넛을 먹었더니 체력이 1 증가한 기분이다!\n");
		a->gold -= 20;//20골드 지불
		a->hp += 1;//체력 1 회복
		sys_print("역시 안전빵이 제일이지!\n");
		break;

	case 3:
		sys_print("(꼬르륵..)\n");
		sys_print("배고프다...\n");
		sys_print("배가 고파서 체력이 1 감소했다.\n");
		a->hp -= 1;//사먹지 않을 경우 체력1 감소
		break;
	}

	sys_printstat(a);//변경된 스탯 출력
	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}


void event_street(player* a) //[1]골목길이벤트
{
	PlaySound(TEXT("event_street.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//골목길 배경음악 출력
	system("cls");
	sys_printstat(a);//캐릭터 스탯창 표시
	Sleep(2000);
	srand((int)time(NULL));
	int sel_1 = 0;

	printf("~!7?^:~:.~!~~~!~^^^!~~^^:~:..:!!?JJ??J??JJJ?77J777!!???!J?JJ?77777!!77!!777!~77??!.^?7JJ\n");
	printf("~!7?~:~^.~!~~~~!^^:~!J??7~:..:7!?JJ??J??JJJ???77!??YP5YJ77~?7!7J7^::!?7J!!7.:7!7!~.:??J?\n");
	printf("~!7?~:^:.~7~~~~!^~?B&@@@@#?..^!!?JJ?J???JJJ????P&@@@@@@@B!.7??!!??~^::^J^!Y?PB#P?!.:7?J?\n");
	printf("~!??~:^^.^!~~~^!^#@@@@@@@@@Y.:!!????????JJJ777#@@@@@@@@@@57??^.:!?::..^JB&@@@@@@@&Y:!?J?\n");
	printf("~!??~:^~.~!^^^:!~&&&&&&&&&&&^:~~???7??7?JJJ777P@&&&&&&&&@P77!:.:~7:~..:J@@&&&&&&&@&~~?J?\n");
	printf("~~??~:^~.~!^:::~?#B########&Y:!7???7????J?J7!!G&########&P?!~:.:~7:^.::?###########!~?J?\n");
	printf("~~??!:^~.~!^^^:~YBPPPPPPPPPB?:7????7??????J?!!5BGGGGGGGGBP77~:..^7:~:~.?#GGGGGGGGGBJ~?JJ\n");
	printf("~~??!:^^.~!7??!!~YYJJJJJJJ55!?????7???????J?!!?PYYYYYYYJPY7??!^:^!:7:~.7B5YYYYYYY5P^!?JJ\n");
	printf("7!??!:~~:!7???JJ?JP5!!!!!?G5YYPY7?7?J?????J7!?!YP777777?GJ^^^~!7!!:!:~:7?P77777775!:!??J\n");
	printf("Y5JJJ?JJJJYY555GP!~J?!???YJP55B5????J?7?Y55YYJYBPYJ!!?JYGPYY?77777!~~!!YJ5Y!~~~~?P7~!??J\n");
	printf("YPYYJ7?77YYYYG@@J:^:??777!!?@@#JYY?J??5G5JJJJJYPGY??JY5B5?J!YYYYY??Y7!~!7~7?777~??Y~7JYY\n");
	printf("J?!!~:!?!^:::5@@P:::^J~:::^B@@P:^7JY5PPJJ?7??JJY5G577?BG?J!!Y??J5GB!    7!!!77~77Y!  .:P\n");
	printf("!!:^77!^::::^#@@@GJ!^^^^~7G@@@&~:::5P5?5J7~!?JJYYPP?JJJG57~~7!7P5JPY    .7~:^~^^!?.    J\n");
	printf("77~~^:::^^::J@@@@@@@&&##&@@@@@@G:^Y5?Y!PY7^!J?YJY5!!77755!^7!^!GBJ?5?    .~7!!!~^      7\n");
	printf("~^::::::!J:!&@@@@@@@@@@@@@@@@@@@GP5??YPGG?!?J?JJP?~~~~^?GJ7J!~?GG?7!5J.     ...       :J\n");
	printf("~:::::::^5G&@@@@@@@@@@@@@@@@@@@@@@&GJJ5G5YJYYJJ?P????77?#5Y?JJYG5JJP#B.             :YBB\n");
	printf("~:::::^!7G@@@@@@@@@@@@@@@@@@@@@@@@@@@&B#P??JJJYP????????#P7JJ?YGB&@@@#.          :75B#G5\n");
	printf(":^~!7777^7@@@@@@@@@@@@@@@@@@@@@@@@@@@@@BG5?J!!YJ^~~~~~~~?P^7JJY#@@@@@@~       .~YB#GY?7~\n");
	printf("?J?!!~^~^~#@@@@@@@@@@@@@@@@@@@@@@@@@@@@PY5J7!^5?!7!!!!!!!G?7YJ5G&@@@@@J    .~JG#BPJ77JJ:\n");
	printf("::::^^^^^^5@@@@@@@@@@@@@@@@@@@@@@@@@@@@&P55J?~PJJJJJJJJJ?Y57J5GP&@@@@@Y  .7G##GY?7777YY~\n");
	printf("...::^:^::?@@@@@@@@@@@@@@@@@@@@@#B@@@@@@#PPY?JY!!!!!!!!!!!5YY5P#@@@@@@^:?B##GJ????77777?\n");
	printf("....::::..J@@@@@@@@@@@@@@@@@@@@@Y:5@@@@@@&PY?G7~~~~~^^^^^^!55YP@@@@@@Y~PPPPY7!7?!75PGP7J\n");
	printf("..........B@@@@@@@@@@@@@@@@@@@@@Y  ?&@@@@@@#GBY????????77775PJ#@@@@@5 .!YJJYJ77!!?PP5?!~\n");
	printf("     ... !@@@@@@@@@@@@@@@@@@@@@@B.  J5&@@@&57J??J5J????JYYJJG#@@@@@Y    :?J?????!~7?J??~\n");
	printf("         J@@@@@@@@@@@@@@@@@@@@@@@! :7:!#@@7.:~?Y5Y~~~~~!YJJ7~#@@@@B:      ^J?7?J?~7??YJJ\n\n");
	sys_print("밤 9시, 집에 돌아가는 길 으슥한 골목길에서 누가 나를 부른다.\n");
	sys_print("큰일이다... 런던의 훌리건 양아치들이다\n");
	printf("양아치 : ");
	sys_print("어이, 거기 지나가는 아저씨, 잠깐 우리 좀 볼까?\n");
	printf("양아치 : ");
	sys_print("뭐, 별건 아니고. 가진 것 좀 있으면 내놓는 게 좋을 텐데?\n");
	sys_print("어떻게 하지?\n");
	sys_print("\n[1]소매를 걷어 팔근육에 힘을 줘 위협한다.\t[2]돈을 뜯긴다.\t[3]눈을 뒤집으면서 미친척을 하며 달려든다!\n");
	Sleep(1000);
	sel_1 = sys_select();

	switch (sel_1) {
	case 1://위협한다 선택 시
		if (((rand() % 5) + (a->str)) > 9) {//힘이 높을수록 성공확률 증가
			sys_printdot();
			sys_print("소매를 슬쩍걷고 삼두근에 힘을 주 압축된 근육을 폭발시키며 양아치들에게 다가간다.\n");
			printf("양아치 : ");
			sys_print("저녀석... 엄청난 팔근육이다.\n");
			sys_print("양아치들은 놀란 듯 눈을 바닥에 고정시킨채 슬쩍 뒤로물러난다\n");
			sys_print("나는 코웃음을치며 양아치들 사이를 당당하게 지나간다.\n");
			sys_print("(뭐야? 이 양아치들 생각보다 별거 아니잖아?)\n");
			sys_print("자신감을 얻어 힘이 1 증가한 기분이다!\n");
			a->str += 1;//힘 증가
		}
		else {//실패했을 경우
			printf("나름 헬린이를 벗어났다 생각한 나는 뒷방 노인네도 코웃음칠 멸치 근육을 내보이며 깡패들을 위협하기 시작했다.\n");
			sys_print("당연히 씨알도 먹히지 않았고, 나는 1시간동안 신나게 밟혔다.\n");
			sys_printdot();
			sys_print("실컷 두드려맞아 체력이 3 감소했다.\n");
			a->hp -= 3;
		}
		break;

	case 2://돈을 뜯기는 선택지 선택 시
		sys_print("50골드를 지불하고 깡패들에게 살려달라고 빌었다.\n");
		a->gold -= 50;//50골드 잃음
		sys_print("젠장할 양아치놈들!! 혼자였으면 한주먹에 기절시켰을텐데..!!\n");
		sys_print("....\n");
		sys_print("으으... 내 골드...\n");

		break;

	case 3://미친척을 할 경우
		if (((rand() % 5) + (a->dex)) > 8) {//민첩이 높을수록 성공확률 증가
			sys_print("나는 귀신에 빙의 된 것처럼 눈에 흰자를 띄운 채 미친척 소리지르기 시작했다.\n");
			sys_print("양아치들은 깜짝 놀란채 자기들끼리 동요하기 시작했다.\n");
			sys_print("얼마 안 가, 한명이 도망치기 시작하자 나머지도 도망쳤다.\n");
			sys_print("그들중 한명이 급하게 도망쳐서인지 느발란스992 한 켤레를 내팽겨둔채 가버렸다.\n");
			sys_print("팔면 수입이 꽤 될 것 같다.\n");
			sys_printdot();
			sys_print("느발란스 992를 중고마켓에 100골드를 받고 팔았다!\n");
			sys_print("기분이 개운해져서 몸이 1정도 민첩해진 것 같다.\n");
			a->gold += 100;//성공시 민첩 및 골드 획득
			a->dex += 1;
		}
		else {//실패 시
			printf("양아치 : ");
			sys_print("뭐야? 저 자식\n");
			sys_print("양아치들이 미친척 하는 내 모습을 보고 비웃기 시작했다..!\n");
			printf("양아치 : ");
			sys_print("미친척 한다고 해서 무서워 할 줄 알았나ㅋㅋ\n");
			sys_printdot();
			sys_print("양아치들에게 뒷통수를 한 대 맞고 50골드를 빼앗겼다..");
			a->gold -= 50;

		}
		break;
	}

	sys_printstat(a);//스탯이 변동되었으니 스탯창 새로 출력
	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}


void event_doyouknow_do(player* a)//[2]도를 아십니까
{

	system("cls");
	sys_printstat(a);//캐릭터 스탯창 표시
	PlaySound(TEXT("event_stranger.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//우선 사운드 종료
	Sleep(2000);

	srand((int)time(NULL));
	int sel_1 = 0, sel_2 = 0;
	int random1 = rand() % 2; //랜덤으로 0 또는 1 값 집어넣음
	printf("??? : ");
	sys_print("혹시 주변에 가까운 서점이 어디인지 알 수 있을까요?\n");
	sys_print("낯선이가 나에게 길을 물어본다.\n");
	sys_print("(가까운 서점의 위치를 대강 알려주었다.)\n");
	printf("??? : ");
	sys_print("친절하시네요, 근데 제가 이지역 사람이 아니라서 그런데 같이한번 가주실 수 있을까요?\n");
	sys_print("어떡하지... 모르는 사람이긴 한데... 도와줄까?\n");
	sys_print("\n[1]도와준다.\t[2]가지 않는다.\n");
	Sleep(100);
	sel_1 = sys_select();
	sys_gonext();
	sys_printstat(a);
	switch (sel_1)
	{
	case 1://도와준다 선택시
		
		sys_printstat(a);
		Sleep(1000);
		sys_print("어라...? 분명히 여기에 서점이 있었는데...? 아무래도 서점의 위치를 까먹은거 같다...\n");
		sys_print("(낯선이에게 길을 잘못들었다고 사실대로 말씀드렸다.)\n");
		printf("??? : ");
		sys_print("아... 그렇군요... 근데 제가 사실 서점을 찾는게 아니였어요.\n");
		printf("??? : ");
		sys_print("당신 조상님의 울음소리가 들려서 조용한 곳으로 가서 알려드리려 했어요.\n");
		printf("??? : ");
		sys_print("조상님이 당신을 찾고계세요. 빨리 제사를 지내야 해요. 어서 갑시다.\n");
		sys_print("낯선 사람에게 제사를 권유받는다... 너무 수상한데.\n");
		sys_print("하지만 이런 대화를 어디서 많이 들어봤던거 같아... 꿈이였나..?\n");
		sys_print("어떡하지? 조상님에게 가야하나?\n");
		sys_print("\n[1]제사를 지내러 간다.\t[2]가지 않는다.\n");
		sel_2 = sys_select();
		switch (sel_2)
		{
		case 1://도와주러 가서 제사를 지내러 갈 경우
			sys_gonext();
			PlaySound(TEXT("event_orient.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//제사를 지낼 경우 절 배경음악 출력
			sys_printstat(a);
			printf("                          :??!~:                                                      :~!??.                            \n");
			printf("                           :!~^~!~^^~!~^^~~~^^~~^^^~~^^~~~^^~!~^^~~^^^!~^^~!~^^~!~^^~!~^^7.                             \n");
			printf("                            .!~!77~~!7!~~77!~~77!~~77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~!                              \n");
			printf("                            :!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^77~^~77~^~7!^^!7!^^!7~^~!.                             \n");
			printf("                            ^!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^!7~^~77^^~7!^^!7!^^!7~^^7.                             \n");
			printf("                            !~~!77~~!7!~~77!~~77!~!77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~?^                             \n");
			printf("                           ^7^^~!!^^~!~^^!!~^^!!^^^!!^^~!!^^~!~^^!!^^^!!^^~!!^^~!~^^!!~^^!!.                            \n");
			printf("                        .:~?7!~!?7!~7?7~!7?!~!7?!~!?7!~!?7!~7?!~!7?!~!?7!~!?7~~7?7~~7?!~!7?!~.                          \n");
			printf("                      .~~^^!!^:^!!^:~!~^^~!~:^!!^^^!!^^~!!^^~!~^^!!^:^!!^:^!!^:~!~:^~!~:^!!^^~!:                        \n");
			printf("                    :~7?!~~77!~!77~~!77~~7?!~~7J5JJJJJJJJJJ?JJJJJJJJ5777~~!77~~!?7~~7?!~~77!~!?7~:                      \n");
			printf("                  :~^^~!~^^!!^^^!!^^~!~^^~!~^^!JP.                 ^G~!!^^~!!^^~!~^^!!~^^!!^^^!~^^~^                    \n");
			printf("               .^!?7~~!7!~~77!~!77~~!77~~77!~~7JP.                 :G777!~!77~~7?7~~77!~!77!~!77~~!?7^.                 \n");
			printf("             .~~^!7!^^!7~^^!!^^~7!^^~!~^^!7~^^!JG~^^^^^^^^^^^^^^^^^!G!!!^^~7!^^~7~^^!7~^^!7~^^!!^^~7!~~^                \n");
			printf("             .^^^~!!~~!7!~~77~~!77~~!7!~~!7!~~7?JJJYYJJJYYJJJYJJJYYJ?!77~~!77~~!7!~~77!~~77~~~7!~~!!~^^^                \n");
			printf("                   ..^YYJ7^~~^^~!!~~~!!~~!7!~~77~^~7!~^~7!^^!7~^^!7~^~77~~~!!~~!!!^~!!~~^~~7JJJ~...                     \n");
			printf("                     :YYY7:::::::::::::::::::::::::^^:::^^:::^:::^^::::::::::::::::::::::::7YYY:                        \n");
			printf("                     :YYY7::::::7?!!!!7!!!!!7?::^J7!!!!!!7??!!!7!!77?::^J!!!7!!!!!7!?!:::::7YYY:                        \n");
			printf("                     :YYY7::::::?7....^..:..~J::^Y^:.....^J?...^..^^J::^Y:.:^.....^ ?7:::::7YYY:                        \n");
			printf("                     :YYY7::::::?7....^..:..~J::^Y~:.....^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
			printf("                     :YYY7::::::?7....~..:..~J::^Y^:.:...^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
			printf("                     :YYY7::::::?! .  ^. .  ^J::^Y^: .. .^J?.  :. :^J::^Y: .: ..  ^ ?7:::::7YYY:                        \n");
			printf("                     :YYY7::::::?!..  ^...  ~J::^Y^: .. .^J?. .^..^^J::^Y: .: ....^ ?7:::::7YYY:                        \n");
			printf("                     :YYY7.:::::?!... ^...  ^J:.^Y^: ....^J?...^..^^J:.^Y: .:.....^ ?7.:::.7YYY:                        \n");
			printf("                     :YYYJ!!!!!7J?~!!~7!!!!~7Y7!7Y7!~!!~~7YJ~~~!~~77Y7!7Y!~!7~!!~!7~JJ!!!!!JYYY:                        \n");
			printf("                    :~7777??!777!!77777777777!7!??????????77?????????7!7!77777777777!!77!??7777~:                       \n");
			printf("                    !^^^^^~^                    ~7!!!!!!!!!!!!!!!!!!7^                   ^~^^^^^!.                      \n");
			printf("                   ~~~~~~~^                   !7777777777777777777777~                  ^!~~~~~~                        \n");
			printf("                    ..::::.                    ^^^^^^^^^^^^^^^^^^^^^^^^                   .:::::.                       \n");
			printf("                                                                                                                        \n");
			printf("                                                                                                                        \n");
			printf("                                       .^~^^^^^^^^^^^^^^^^^^^^^^^~^^^^^^^^^^^                                           \n");
			printf("                                       ^PPPPPPGPPPPPPPPPPPPPPPPPPPPPPPPPPPPP5                                           \n");
			printf("                                       :PPPPP5?PP55PP555P55PP55PP75P55PPPPPP5                                           \n");
			printf("                                       :PPPPPY~PJ7J75!Y?7Y75?7Y!P!PJ7J7PPPPP5                                           \n");
			printf("                                       :PPPPP5!5J7JJP!PY?G?Y?7Y7P7YJ7JJPPPPP5                                           \n");
			printf("                                       ^GGPPPGPPGPPPGPPPPGPGJJPPGPPGPPPGPPPG5                                           \n");
			printf("                                       .!!!!!!!!!!7!!!!!!!!!!!7!!!!!!7!!!!!7!                                            \n");
			sys_print("그래. 조상님이 나를 찾으신다잖아. 빨리 가서 도와드리자.\n");
			sys_print("(낯선이에게 어서 가자고 말했다.)\n");
			printf("??? : ");
			sys_print("그래요. 어서가서 조상님께 효도합시다. 가시죠.\n");
			sys_print("그렇게 낯선이를 따라가니 연락소라는 간판이 붙어있는 건물로 들어갔다.\n");
			sys_print("촛불이 켜져있는 복도를 지나 제사를 지내는 방으로 들어왔다.\n");
			printf("??? : ");
			sys_print("참고로 제사에는 제사음식부터 인건비, 부가세.... 등을 포함해서 100골드 입니다.\n");
			sys_print("(100골드?! 너무 비싸잖아!! 저기ㅇ...)\n");
			sys_print("그 순간 방의 모든불이 꺼지더니 제사가 시작됐다.\n");
			printf("??? : ");
			sys_print("어서 조상님께 고개를 조아리세요!! 당장이요!!\n");
			sys_print("나는 당황을 금치 못해 눈을 질끈감고 쫓기듯이 절을했다.\n");
			sys_print("그순간");
			sys_printdot();
			switch (random1)//랜덤1에는 0과 1 중 랜덤한 값이 하나 들어가있음
			{
			case 0:// 1/2 확률로 영혼 부르기 성공
				sys_gonext();
				sys_printstat(a);
				printf("                          :??!~:                                                      :~!??.                            \n");
				printf("                           :!~^~!~^^~!~^^~~~^^~~^^^~~^^~~~^^~!~^^~~^^^!~^^~!~^^~!~^^~!~^^7.                             \n");
				printf("                            .!~!77~~!7!~~77!~~77!~~77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~!                              \n");
				printf("                            :!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^77~^~77~^~7!^^!7!^^!7~^~!.                             \n");
				printf("                            ^!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^!7~^~77^^~7!^^!7!^^!7~^^7.                             \n");
				printf("                            !~~!77~~!7!~~77!~~77!~!77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~?^                             \n");
				printf("                           ^7^^~!!^^~!~^^!!~^^!!^^^!!^^~!!^^~!~^^!!^^^!!^^~!!^^~!~^^!!~^^!!.                            \n");
				printf("                        .:~?7!~!?7!~7?7~!7?!~!7?!~!?7!~!?7!~7?!~!7?!~!?7!~!?7~~7?7~~7?!~!7?!~.                          \n");
				printf("                      .~~^^!!^:^!!^:~!~^^~!~:^!!^^^!!^^~!!^^~!~^^!!^:^!!^:^!!^:~!~:^~!~:^!!^^~!:                        \n");
				printf("                    :~7?!~~77!~!77~~!77~~7?!~~7J5JJJJJJJJJJ?JJJJJJJJ5777~~!77~~!?7~~7?!~~77!~!?7~:                      \n");
				printf("                  :~^^~!~^^!!^^^!!^^~!~^^~!~^^!JP.                 ^G~!!^^~!!^^~!~^^!!~^^!!^^^!~^^~^                    \n");
				printf("               .^!?7~~!7!~~77!~!77~~!77~~77!~~7JP.                 :G777!~!77~~7?7~~77!~!77!~!77~~!?7^.                 \n");
				printf("             .~~^!7!^^!7~^^!!^^~7!^^~!~^^!7~^^!JG~^^^^^^^^^^^^^^^^^!G!!!^^~7!^^~7~^^!7~^^!7~^^!!^^~7!~~^                \n");
				printf("             .^^^~!!~~!7!~~77~~!77~~!7!~~!7!~~7?JJJYYJJJYYJJJYJJJYYJ?!77~~!77~~!7!~~77!~~77~~~7!~~!!~^^^                \n");
				printf("                   ..^YYJ7^~~^^~!!~~~!!~~!7!~~77~^~7!~^~7!^^!7~^^!7~^~77~~~!!~~!!!^~!!~~^~~7JJJ~...                     \n");
				printf("                     :YYY7:::::::::::::::::::::::::^^:::^^:::^:::^^::::::::::::::::::::::::7YYY:                        \n");
				printf("                     :YYY7::::::7?!!!!7!!!!!7?::^J7!!!!!!7??!!!7!!77?::^J!!!7!!!!!7!?!:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....^..:..~J::^Y^:.....^J?...^..^^J::^Y:.:^.....^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....^..:..~J::^Y~:.....^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....~..:..~J::^Y^:.:...^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?! .  ^. .  ^J::^Y^: .. .^J?.  :. :^J::^Y: .: ..  ^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?!..  ^...  ~J::^Y^: .. .^J?. .^..^^J::^Y: .: ....^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7.:::::?!... ^...  ^J:.^Y^: ....^J?...^..^^J:.^Y: .:.....^ ?7.:::.7YYY:                        \n");
				printf("                     :YYYJ!!!!!7J?~!!~7!!!!~7Y7!7Y7!~!!~~7YJ~~~!~~77Y7!7Y!~!7~!!~!7~JJ!!!!!JYYY:                        \n");
				printf("                    :~7777??!777!!77777777777!7!??????????77?????????7!7!77777777777!!77!??7777~:                       \n");
				printf("                    !^^^^^~^                    ~7!!!!!!!!!!!!!!!!!!7^                   ^~^^^^^!.                      \n");
				printf("                   ~~~~~~~^                   !7777777777777777777777~                  ^!~~~~~~                        \n");
				printf("                    ..::::.                    ^^^^^^^^^^^^^^^^^^^^^^^^                   .:::::.                       \n");
				printf("                                                                                                                        \n");
				printf("                                                                                                                        \n");
				printf("                                       .^~^^^^^^^^^^^^^^^^^^^^^^^~^^^^^^^^^^^                                           \n");
				printf("                                       ^PPPPPPGPPPPPPPPPPPPPPPPPPPPPPPPPPPPP5                                           \n");
				printf("                                       :PPPPP5?PP55PP555P55PP55PP75P55PPPPPP5                                           \n");
				printf("                                       :PPPPPY~PJ7J75!Y?7Y75?7Y!P!PJ7J7PPPPP5                                           \n");
				printf("                                       :PPPPP5!5J7JJP!PY?G?Y?7Y7P7YJ7JJPPPPP5                                           \n");
				printf("                                       ^GGPPPGPPGPPPGPPPPGPGJJPPGPPGPPPGPPPG5                                           \n");
				printf("                                       .!!!!!!!!!!7!!!!!!!!!!!7!!!!!!7!!!!!7!                                            \n\n");
				printf("조상님 : ");
				sys_print("와주었구나...\n");
				sys_print("백발의 할아버지의 환영이 눈앞에 아른거린다.\n");
				printf("조상님 : ");
				sys_print("생전에 손주를 못본게 한이여서 이승에 남아있었지만... \n");
				printf("조상님 : ");
				sys_print("이제는... 이제는... 정말 갈 수 있겠다... 고맙다...\n");
				sys_print("환영이 사라지며 눈이 떠졌다.\n");
				sys_print("낯선이가 일어서서 나에게 다가온다.\n");
				printf("??? : ");
				sys_print("제사가 모두 끝났습니다. 비용은 100골드 입니다.\n");
				sys_print("100골드... 비싸지만 가치가 있었던 것 같아.\n");
				sys_print("일단 으스스한 이곳에서 나가자.\n");
				sys_print("건물을 나와보니 이상하리만큼 몸이 가볍다. 컨디션도 최고조다!\n");
				sys_print("100 골드를 지불하고 체력, 힘, 민첩이 3 증가했습니다.\n");
				a->gold -= 100;
				a->hp += 3;
				a->str += 3;
				a->dex += 3;
				break;
			case 1:// 1/2 확률로 영혼 부르기 실패
				sys_gonext();
				
				sys_printstat(a);
				printf("                          :??!~:                                                      :~!??.                            \n");
				printf("                           :!~^~!~^^~!~^^~~~^^~~^^^~~^^~~~^^~!~^^~~^^^!~^^~!~^^~!~^^~!~^^7.                             \n");
				printf("                            .!~!77~~!7!~~77!~~77!~~77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~!                              \n");
				printf("                            :!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^77~^~77~^~7!^^!7!^^!7~^~!.                             \n");
				printf("                            ^!^~7!^^!7!^^!7~^~!7~^~7!~^~7!^^!7~^^!7~^~77^^~7!^^!7!^^!7~^^7.                             \n");
				printf("                            !~~!77~~!7!~~77!~~77!~!77~~!77~~!7!~~77~~~77~~!77~~!7!~~77!~~?^                             \n");
				printf("                           ^7^^~!!^^~!~^^!!~^^!!^^^!!^^~!!^^~!~^^!!^^^!!^^~!!^^~!~^^!!~^^!!.                            \n");
				printf("                        .:~?7!~!?7!~7?7~!7?!~!7?!~!?7!~!?7!~7?!~!7?!~!?7!~!?7~~7?7~~7?!~!7?!~.                          \n");
				printf("                      .~~^^!!^:^!!^:~!~^^~!~:^!!^^^!!^^~!!^^~!~^^!!^:^!!^:^!!^:~!~:^~!~:^!!^^~!:                        \n");
				printf("                    :~7?!~~77!~!77~~!77~~7?!~~7J5JJJJJJJJJJ?JJJJJJJJ5777~~!77~~!?7~~7?!~~77!~!?7~:                      \n");
				printf("                  :~^^~!~^^!!^^^!!^^~!~^^~!~^^!JP.                 ^G~!!^^~!!^^~!~^^!!~^^!!^^^!~^^~^                    \n");
				printf("               .^!?7~~!7!~~77!~!77~~!77~~77!~~7JP.                 :G777!~!77~~7?7~~77!~!77!~!77~~!?7^.                 \n");
				printf("             .~~^!7!^^!7~^^!!^^~7!^^~!~^^!7~^^!JG~^^^^^^^^^^^^^^^^^!G!!!^^~7!^^~7~^^!7~^^!7~^^!!^^~7!~~^                \n");
				printf("             .^^^~!!~~!7!~~77~~!77~~!7!~~!7!~~7?JJJYYJJJYYJJJYJJJYYJ?!77~~!77~~!7!~~77!~~77~~~7!~~!!~^^^                \n");
				printf("                   ..^YYJ7^~~^^~!!~~~!!~~!7!~~77~^~7!~^~7!^^!7~^^!7~^~77~~~!!~~!!!^~!!~~^~~7JJJ~...                     \n");
				printf("                     :YYY7:::::::::::::::::::::::::^^:::^^:::^:::^^::::::::::::::::::::::::7YYY:                        \n");
				printf("                     :YYY7::::::7?!!!!7!!!!!7?::^J7!!!!!!7??!!!7!!77?::^J!!!7!!!!!7!?!:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....^..:..~J::^Y^:.....^J?...^..^^J::^Y:.:^.....^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....^..:..~J::^Y~:.....^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?7....~..:..~J::^Y^:.:...^J?...^..^^J::^Y:.:^..:..^.?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?! .  ^. .  ^J::^Y^: .. .^J?.  :. :^J::^Y: .: ..  ^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7::::::?!..  ^...  ~J::^Y^: .. .^J?. .^..^^J::^Y: .: ....^ ?7:::::7YYY:                        \n");
				printf("                     :YYY7.:::::?!... ^...  ^J:.^Y^: ....^J?...^..^^J:.^Y: .:.....^ ?7.:::.7YYY:                        \n");
				printf("                     :YYYJ!!!!!7J?~!!~7!!!!~7Y7!7Y7!~!!~~7YJ~~~!~~77Y7!7Y!~!7~!!~!7~JJ!!!!!JYYY:                        \n");
				printf("                    :~7777??!777!!77777777777!7!??????????77?????????7!7!77777777777!!77!??7777~:                       \n");
				printf("                    !^^^^^~^                    ~7!!!!!!!!!!!!!!!!!!7^                   ^~^^^^^!.                      \n");
				printf("                   ~~~~~~~^                   !7777777777777777777777~                  ^!~~~~~~                        \n");
				printf("                    ..::::.                    ^^^^^^^^^^^^^^^^^^^^^^^^                   .:::::.                       \n");
				printf("                                                                                                                        \n");
				printf("                                                                                                                        \n");
				printf("                                       .^~^^^^^^^^^^^^^^^^^^^^^^^~^^^^^^^^^^^                                           \n");
				printf("                                       ^PPPPPPGPPPPPPPPPPPPPPPPPPPPPPPPPPPPP5                                           \n");
				printf("                                       :PPPPP5?PP55PP555P55PP55PP75P55PPPPPP5                                           \n");
				printf("                                       :PPPPPY~PJ7J75!Y?7Y75?7Y!P!PJ7J7PPPPP5                                           \n");
				printf("                                       :PPPPP5!5J7JJP!PY?G?Y?7Y7P7YJ7JJPPPPP5                                           \n");
				printf("                                       ^GGPPPGPPGPPPGPPPPGPGJJPPGPPGPPPGPPPG5                                           \n");
				printf("                                       .!!!!!!!!!!7!!!!!!!!!!!7!!!!!!7!!!!!7!                                            \n\n");
				sys_print("엥...?\n");
				sys_print("아무리 조상님을 떠올려도 머릿속이 새하얗다.\n");
				sys_print("아무래도 이거... 당한 것 같다.\n");
				sys_print("낯선이가 일어서서 나에게 다가온다.\n");
				printf("??? : ");
				sys_print("제사가 모두 끝났습니다. 비용은 100골드 입니다.\n");
				sys_print("아... 당했구나... 일단 으스스한 이곳에서 나가자.\n");
				sys_print("터벅터벅 건물에서 걸어나왔다.\n");
				sys_print("피곤해... 이게 무슨 고생이냐... 몸도 무겁고.. 컨디션 최악이야.\n");
				sys_print("100골드를 지불하고 체력이 1 감소했다...\n");
				a->gold -= 100;
				a->hp -= 1;
				break;
			}
			break;
		case 2://도와주러 갔다가 제사를 지내러 가지 않겠다고 할 경우
			sys_gonext();
			sys_printstat(a);
			sys_print("그래. 아무리 그래도 이건 아니야. 너무 수상하잖아. 가지 말자.\n");
			sys_print("(한시간뒤에 친구와 약속이 있다고 둘러댔다.)\n");
			printf("??? : ");
			sys_print("...\n");
			printf("??? : ");
			sys_print("제사를 안지내고도 당신이 무사할것 같아?\n");
			printf("??? : ");
			sys_print("조상님의 슬픔을 무시하는 너같은 놈은 큰 화를 입게될거야. 알겠어?\n");
			sys_print("낯선이는 씩씩거리며 자리를 떠났다.\n");
			sys_print("뭐야... 재수없어... 기분이 썩 좋지않다. 그래도 잘 뿌리쳤다.\n");
			break;
		}
		break;

	case 2://아예 도와주러 가지 않을 경우
		sys_print("(한시간뒤에 친구와 약속이 있다고 둘러댔다.)\n");
		printf("??? : ");
		sys_print("아... 네.\n");
		sys_print("낯선이는 뒤도 돌아보지 않고 떠났다.\n");
		sys_print("...? 낯선이는 멀리가지 않아 또 다른 누군가에게 말을 건넨다.\n");
		sys_print("살짝 들어 보니까, 방금 그 사람이 이번에는 백화점이 어디냐고 물어보고 있네?");
		sys_print("뭔가 이상한 사람이네. 안 도와주길 잘했어.\n");
		break;
	}
	Sleep(300);
	system("cls");
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}



void event_busking(player* a)//[3]버스킹 이벤트
{
	system("cls");//이벤트 시작
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//우선 사운드 종료
	sys_printstat(a);
	Sleep(2000);
	int sel_1 = 0;

	sys_print("근처 공원에서 누군가가 통기타를 치고 노래를 부르며 버스킹을 하고있다. 한번 가보자.\n");
	sys_print("(터벅터벅)\n");
	sys_print("도착한 순간, 노래가 끝났고 듣고있던 사람들이 박수갈채를 보낸다. 제대로 듣지도 못했는데... \n");
	sys_print("버스커가 통기타를 내려놓고 돈을 내러오는 사람들에게 반갑게 인사를 건넨다.\n");
	sys_print("잘은 모르지만 느낌이 이쪽 동네에선 나름 유명한 사람인 것 같다. \n");
	sys_print("박수가 잦아들고 버스커가 다시 마이크를 잡았다.\n");
	sys_print("버스커 : 다음으로 뭘 들려드릴까요? 노래? 랩? 아니면...춤?\n\n");
	sys_print("축구장이 아닌 영국 한복판에서 즐기는 버스킹이라니... 너무 좋아..!! 이제야 영국에 온 것 같아!!!\n");
	sys_print("감미로운 목소리로 듣는 노래, 듣기만 해도 전투력이 올라가는 랩, 버스커가 수줍게 제안한 춤, 어떤 것을 해달라고 할까?\n\n");
	sys_print("\t[1]노래\t\t[2]랩\t\t[3]춤\n");

	sel_1 = sys_select();

	switch (sel_1)//노래를 선택할 경우
	{
	case 1:
		printf("                                             .^!7JJYYYYYYYYJ7~.                                                         \n");
		printf("                                         .^!7JJJ??77!!!!!!!77?JY?^                                                      \n");
		printf("                                       ^?JJ?77!!!!7777777?7!!!!!?YY~                                                    \n");
		printf("                                     ^YYJ5!!!77777777777!J5Y?!!7!!7YY!.                                           ^^^~. \n");
		printf("                                    ~P?!JP!77777777777777!!?Y5?!77!!7JY7:                                         ^^.:. \n");
		printf("                                   .P?!!JG!7777777777777777!!?PY!777!!7?YJ!:                                      7^^^. \n");
		printf("                                   ^G!7!7G7!77777777777777777!!55!!!!!!!!7?YY7                                    ^.:^. \n");
		printf("                                   ^G!77!55!777777777777777777!!J777??7???JJY!                                    ~~:^: \n");
		printf("                                   ^G!77!7G?!77777777777777!!!7JJJ?7!J#PJ!^.                                      ^~^~. \n");
		printf("                                   :G7!77!?G7!7777777!!!!!!7JYJ!.  . ^#PGPY~                                      :^::. \n");
		printf("                                   .G7?YJY!JG7!77!!!7??JJYGPP5?!JY5YYYPY?YG~                                      ~~!~: \n");
		printf("                                   .P7G^.G7!JP7!7?JJ?7~^:.^!?555GPPY5Y??55:                                       :~^^. \n");
		printf("                                   :G?P .G7!!JYJY?^.         ?G?JBYP?P557                                         ^^:^: \n");
		printf("                                   ~P?5 .P77?JJ5?^           :JYYY7: !P.                                          ^~!~. \n");
		printf("                                  YYJY  55??!: .                 .~!??                                           ~~:..  \n");
		printf("                              ..:^^P55J  75?!^7J!?           .!!7.!G!.                                            !:^^. \n");
		printf("                        .:~!7??77!757Y!  7Y: .YY.!Y:        ~Y^^5?Y: .!?JJ!77?~.::.                                     \n");
		printf("                    .^!??7!~^^::::::5Y  .~  !Y^!P^~Y~       ??!??Y. :PY5GY5B.^G!!?5?77^:                            ~.  \n");
		printf("                  ^7J7~^:~^::::::::!P      .! :Y~7J.7?!^...  .:!Y7?!YGJB?YGG^:5.J7:?Y7^!Y:                          .   \n");
		printf("                ~J?~:::::~Y?:::::::!5         :: ~Y   :?GJ5PYJ?~ ~Y^.!5GYGG5P5!J? ?? :!.~5                         ^^^. \n");
		printf("              :Y?^:::::::::?Y::::::~P           :G?~^~!Y!:^^~!777!~77!^^^:^75G!P.:P :P5YYG?^.                      7~~. \n");
		printf("             ~5~:??7!^::::::JY:::::?J          ~5!~!!!~^::::::::^~7?7~~77~:  .?P7~G~5PYYJY#5YJ?!^.                 ~!!. \n");
		printf("            !5^::^^~7JJ7^::::57:::^P:         ?Y^:::::::::::::::::::!Y! .^7?7:  ~!~^: :~G??JYY55GB?~.              ~^~: \n");
		printf("           :P^::::::::^7Y?^::!P:::5!        ^Y7:::::::::::::::::::::::JJ.   ^7J:       ??    .:^!!JPG57:           ~^~: \n");
		printf("           Y7::::::::::::!Y?::P~^5!        75^:::::::::::::::::::::::::75:    ~5       P:           :!YBY:          .^. \n");
		printf("          ^5:::::::::::::::?5^YYY~        !5::::::::::::::::::::::::::::~5~   ~Y       P:              ^P#7       :~!!. \n");
		printf("          Y7::::::::::::::::~5P5:        :P^::::::::::::::::::::::::::^^:^5!  7J       P^                7&5.     :!:~: \n");
		printf("         ^P:::::::::::::::::^5?          Y?:::::::::::::::::::::::::::5!::^Y7 J7       5~                 ~#P.     ~!!. \n");
		printf("         57::::::::::::::::7Y^          :P::::::::::::::::::::::::::::57::::Y?5^       Y!                  ~&Y     !^!: \n");
		printf("        ^P:::::::::::::::^Y?            J?::::::::::::::::::::::::::::Y?:::::YG        J7                   ?@!   .!~!. \n");
		printf("        JJ:::^!!~~~^^^::7Y^            :P^::::::::::::::::::::::::::::Y?:::::J?        ?7                   .BB.   ~~~: \n");
		printf("        57::7Y!~~!!777J57.             5!:::::::::::::::::::::::::::::Y?::::~P.        ?7                    ?@!   ~~!: \n");
		sys_print("오늘은 감성적인 노래를 듣고싶어. 노래를 듣자!!\n");
		sys_print("나는 손을 번쩍들고 말했다.\n");
		sys_print("나 : 노래 불러주세요!!\n");
		PlaySound(TEXT("event_sing.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//발라드 노래 출력
		sys_print("버스커 : 그래 좋아요. 저분을 위한 자작곡을 들려드릴게요.\n\n");
		sys_print("나는 축구벌레~~ ♪~ ♫~~ 친구가 없네~~~ ♬~ 𝅘𝅥𝅯~~\n");
		sys_print("축구선수가 되고 싶었지만 ~~ ♪~ ♫~~ 이렇게 되다니~~~ ♬~ 𝅘𝅥𝅯~~\n\n");
		sys_print("(가사가 심금에 울려온다... 눈물이 날것같아.)\n");
		sys_print("디리리링~~ ♪~~ ... 감사합니다. 오늘은 여기까지 하겠습니다. 여러분 모두 좋은하루 되세요!!\n");
		sys_print("마음이 따뜻해지는 노래였어. 기분이 날아갈 것 같아!!\n");
		sys_print("나 어쩌면... 저 사람의 팬이 되어버렸을지도...?\n\n");
		sys_print("노래를 듣고 민첩이 1 증가했다.\n");
		a->dex += 1;
		break;
	case 2://랩을 선택했을 경우
		printf(".........................................^: ............................................................................\n");
		printf("....................................... ?&G: ...........................................................................\n");
		printf(".........................................Y@B^ ..........   .............................................................\n");
		printf("......................................... ?&B^..........:~^:.. .........................................................\n");
		printf("........................................:::?##7:...... ?###GPP7:  ......................................................\n");
		printf(".....................................:^^^^^^!57^^......!!!!~~75BY~......................................................\n");
		printf("..................................:^^^^^^:::::?5Y^....~~^7?7~^7#@&5.....................................................\n");
		printf("...............................:^^^^^^:...... J@@B:..:~~^~~^^^!B@&@7 ...................................................\n");
		printf(".............................:^^^^^^:..........~7^...~!7~^^^^^!PJ75J ...................................................\n");
		printf("...........................:^^^^^^:............   ...!?J7^^^^^^^~7Y^ ...................................................\n");
		printf(".........................:^^^^^^:....................777^^^^^^^5#P!.....................................................\n");
		printf(".......................:^^^^^^^^::......  ...........:^^^^^~~~!J^  .....................................................\n");
		printf(".......................:^^^^^^^^^^^^^:!Y7~:..  ...    ^^~~!!!!.   ......................................................\n");
		printf("..........................:^^^^^^^^^^^J555YJ?77?JJ?77!!!~~!!!!:::^:..  .................................................\n");
		printf(".............................:^^^^^^^!YYYYY555555555555YYYYYYYYYY5YYJ7~. ...............................................\n");
		printf("................................:^^^^?5YYYYYYYYYYYYYYYYYYYY55555YYY5555Y!. .............................................\n");
		printf("....................................:Y55555YYYYYYYYYYYYYYYYYYYYYYYYYYYY55J^ ............................................\n");
		printf(".....................................:^~~!J5YYYYYYYYYYYYYYYYYYYYYYYYYYYYY5Y7. ..........................................\n");
		printf(".....................................     !5YYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY5Y~..........................................\n");
		printf("......................................... !5YYYYYYYYYYYYYYYYYYYYYYY5Y5YYYY555Y^.........................................\n");
		printf("......................................... ~5YYYYYYYYYYYYYYYYYYYYYY5J:7555YJ7~^^:........................................\n");
		printf("......................................... ~5YYYYYYYYYYYYYYYYYYYYY5J. .7?!~^^^^^^^.......................................\n");
		printf("......................................... ~5YYYYYYYYYYYYYYYYYYYYYY: ... ..:^^^^^^^:.....................................\n");
		printf("......................................... ^5YYYYYYYYYYYYYYYYYYYYYY:.........:^^^^^^^^:..................................\n");
		printf("......................................... :YYYYYYYYYYYYYYYYYYYYY5Y:...........:^^^^^^^^:................................\n");
		printf("...........................................Y5YYYYYYYYYYYYYYYYYY557..............:^^^^^^^^...............................\n");
		printf("...........................................?5YYYYYYYYYYYYYYYYYYY^ .................:^^^^^^:.............................\n");
		printf(".......................................... 75YYYYYYYYYYYYYYYYY5J.....................:^^^^^^:...........................\n");
		printf(".......................................... ~5YYYYYYYYYYYYYYYYY5Y........................:^^^^^:.........................\n");
		printf(".......................................... ^5YYYYYYYYYYYYYYYYYY5^ ........................:^^^^^:.......................\n");
		printf("............................................Y5YYYYYYYYYYYYYYYYY57 ...........................^^^^^::....................\n");
		printf("............................................J5YYYYYYYYYYYYYYYYYYJ.............................^^^^^^^:..................\n");
		printf("............................................?YYYYYYYYYYYYYYYYYYY?..............................:.::^::..................\n");
		sys_print("나는 랩은 잘 모르지만 사실 랩스타가 늘 꿈이였어. 힙합을 듣자!!\n");
		sys_print("나는 손을 번쩍들고 말했다.\n");
		sys_print("나 : 랩 해주세요!!\n");
		sys_print("버스커가 이를 듣자 가방을 뒤져서 선글라스를 꼈다.\n");
		sys_print("버스커 : OK 알겠어요. 당신을 위한 랩, drop the beat!!\n\n");
		PlaySound(TEXT("event_rap.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//힙합 음악 출력
		Sleep(1000);
		sys_print("Yo~ 나는 명사수~♪ 골문 겨냥하는 공격수~♫\n");
		Sleep(500);
		sys_print("내가 바보? 너도 바보!! 나는 박명수~♬ Yo ~♪ let's get it man ~𝅘𝅥𝅯 \n\n");
		Sleep(500);
		sys_print("여러분 모두 감사합니다. 오늘은 버스킹은 여기까지입니다. 모두 좋은하루 되세요, peace!!\n");
		sys_print("가사가 정말 맘에든다... 듣기만 해도 전투력이 상승할 것 같아!!\n");
		sys_print("나 어쩌면... 저 사람의 팬이 되어버렸을지도...?\n\n");
		sys_print("힙합을 듣고 힘이 1 증가했다.\n");
		a->str += 1;
		break;
	case 3://춤을 선택했을 경우
		sys_gonext();
		sys_printstat(a);
		sys_print("엊그제 TV에서 봤던 스트릿런던파이터가 생각났다. 춤을 보고싶어!!\n");
		sys_print("나는 손을 번쩍들고 말했다.\n");
		sys_print("나 : 춤 춰주세요!!\n");
		sys_print("버스커가 이를 듣자마자 고개를 휙 돌리며 나를 쳐다보았다.\n");
		sys_print("버스커 : ... 나의 재능을 알아보는 사람은 당신이 처음입니다.... 울컥하네요.\n");
		sys_print("(아니... 그냥 춤 보고싶어서 말한건데 ...)\n");
		sys_print("버스커 : 당신 덕분에 감동했습니다. 최선을 다해 제 모든 것을 보여드릴게요!!\n");
		PlaySound(TEXT("event_dance.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//춤추는 음악 출력
		Sleep(1000);
		sys_print("스피커에서 헤이파파 노래가 나오기 시작했다!! 벌써 신나잖아!! \n\n");
		printf("                                                     .:::^~:.                                       \n");
		printf("                                                   :~^7.^^^~7~:.                                    \n");
		printf("                                                 :~^.:!^!^ .^!77^.                                  \n");
		printf("                                                ^:^75P5Y5Y!^:  ^7?!^.                               \n");
		printf("                                               ::!PPGBGPPBBJ:..  :!!7~:.                            \n");
		printf("                                               ^!BP#B&#BGBB#5.  .  .:..^~.                          \n");
		printf("                                               :B#B&PP55PY5B@B^ .       ^~                          \n");
		printf("                                               ^BP?~:  :.  ^G&#~.        ~~                         \n");
		printf("                                               ^P.          ?&#?!^.      ^7                         \n");
		printf("                                              ~P#^   ..    .G&G~...  ^!  ~~                         \n");
		printf("                                           .!P&G&G. ^J!~   ~&&5.    .7^ :7.                         \n");
		printf("                                     .:::^^!B&&BBBP::?!^..:G#&G  .  !~  ~7                          \n");
		printf("                                     ^~!   ^G&@G#&&G^:^^^~G&&#B..  ^!:  7!                          \n");
		printf("                                  .^  .!  7B#&@B#@&G....:G&&&##:  ^^^ : 7^                          \n");
		printf("                                  7!  .~:?BP&@@#&@@J ..?B@&BB#B^ .~^.^^ !^                          \n");
		printf("                                 .?^. .~JGPG@@@#&@&^ ^5&&#P##&&?..~::^  !^                          \n");
		printf("                                 ~~~^ .!5YP&@&@P&@J .P&&BB#@@&@?::^.^  .~.                          \n");
		printf("                                .! ~! :?PP&@&B&##!..?&&@B&@B#B&7.::: .^^                            \n");
		printf("                               .:~ .? !Y######&@G:.^BB##5&@P###J :^ .~^                             \n");
		printf("                               ::^  ?:!Y&&P5B&&@5.^J#GB5B@&!B&BJ.^.^~.                              \n");
		printf("                              :. .  ~7^5@&YGB5GPJ^:?BBP7&@G.B@5!:~~:                                \n");
		printf("                              ^   . .7~Y@P?&#Y7:?^.5@577&&?.&&: ^^.                                 \n");
		printf("                             .:   ...:!JB7?@P!^ 7.^5P:^~5J:^#! 7.                                   \n");
		printf("                             :.    ..::!^ JY^..!^ ~~  . .~ .. .7                                    \n");
		printf("                             :      .: ~^ :. .!~  ~:         ..!                                    \n");
		printf("                                :^::^! :^^  :!!....      .... .!                                    \n");
		printf("                             ...^.  :^:^7^~:^~^ ..    ....    .~                                    \n");
		printf("                             :.^.   :. ^~  .:.!  :^~^^~~!^...^^                                     \n");
		printf("                             .~:.^^:^: ^~   : !.:^^!^::.     :7.                                    \n");
		printf("                              .^. .::^ .~~~!!~!~^^^:.   ..:.. :~^                                   \n");
		printf("                              :   ^^:~   ..:.....:::.....   .  :^:                                  \n");
		printf("                                ^.:^:~! .::..::::::.          .   ^^                                \n");
		printf("                                 ^~::J.::.        ^.           .   ~.                               \n");
		printf("                                  :~J~.           :.           .   .!                               \n");
		printf("                                   ~!             :.            .   :~                              \n");
		printf("                                 ^7^              ..            .    ~:                             \n");
		printf("                                !!.             ...                   ~                             \n");
		printf("                              :?~               .::                   :~                            \n");
		printf("                             !7:                  ~!                   !:                           \n");
		printf("                           ^7^.           ....  .!77:                  :7                           \n");
		printf("                         .!~.               :  ^7^ .~~       .          7:                          \n");
		printf("                        :!.                .:.7!.    ^!.    .           ~~                          \n");
		printf("                      .^^                  .~7^       .!^               .7                          \n");
		printf("                     :^                 ..^7~           ~~               7.                         \n\n");
		sys_print("Yes I be your football~♪, Yes I be your soccer~♬\n");
		sys_print("(뭐지... 나 왜 저 춤을 알고있는거야..!! 저 춤을 보니 댄싱머신이 된 것같은 기분이야 !!!)\n");
		sys_print("버스커 : 헉.... 헉.... 여러분... 힘드네요 ... 오늘은 여기까지.... 다음에 또 봐요!!!... 콜록콜록\n");
		sys_print("저분은 노래도 잘하고 춤도 잘 춰.. 멋있다.. 나 어쩌면... 저 사람의 팬이 되어버렸을지도... ? \n\n");
		sys_print("버스커에게 감사의 의미로 50골드를 지불했다.\n");
		sys_print("버스커의 비장의 무기를 보고 힘과 민첩이 1씩 증가했다.\n");
		a->gold -= 50;
		a->str += 1;
		a->dex += 1;
		sys_printstat(a);
		
		break;
	}
	sys_gonext();
	Sleep(1000);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}


void event_sportstoto(player* a)//[4]첼블루vs갱스날 승부예측
{
	system("cls");//이벤트 시작
	sys_printstat(a);
	Sleep(2000);
	PlaySound(TEXT("event_sportstoto.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//챔피언스리그 배경음악 출력
	Sleep(1500);
	srand(time(NULL));
	

	int bet = 1;
	int sel1 = 0;
	int ran = 0;
	int win = 0;

	sys_print("길을 걷다가 첼블루FC의 홈구장인 슛탬퍼드 브릿지 앞에 도착했다.\n");
	sys_print("경기장 아나운서 : 오늘은 첼블루FC와 갱스날FC의 런던 더비가 있는 날입니다!\n");
	sys_print("경기장 아나운서 : 많은 전문가들과 해설위원들은 첼블루FC가 갱스날FC에 비해 7:3정도로 유리하게 평가하는데요...\n");
	sys_print("나도 이렇게 떠돌이 인생만 아니었어도 저렇게 수많은 팬들 앞에서 경기를 뛰었을 텐데...\n");
	sys_print("기분이 우울해져서 돌아가려고 한 순간, 바닥에 떨어진 전단지 한 장이 눈에 들어왔다.\n\n");
	sys_print("'오늘 있을 경기에 대한 승부 예측 이벤트 진행중!'\n");
	sys_print("'승부 예측 적중 시 베팅한 골드의 두배를 획득합니다!'\n\n");
	sys_print("승부 예측이라... 이거 흥미가 생기는데?\n");
	sys_print("승부 예측을 하기 위해 경기장 앞의 부스로 이동했다.\n");
	sys_gonext();



	sys_printstat(a);
	sys_print("안내원 : 승부 예측을 진행합니다.\n");
	sys_print("분명히 아까 들은대로 첼블루FC의 최근 기세가 좋아 7:3정도로 유리하다고 들었다.\n");
	sys_print("안내원 : 하지만 여태까지의 상대 전적에서 첼블루FC는 40승 10무 50패로 밀리는 편이지요.\n");
	sys_print("안내원 : 그럼, 얼마를 베팅하실 건가요?\n");
	while (1) {//반복문을 사용해서 베팅 금액이 보유 골드를 초과하거나 0원일 경우 다시 베팅하게 설정
		bet = sys_select();//베팅 금액 입력받음
		if (a->gold < bet) {//보유 골드보다 베팅금이 초과할 경우
			sys_print("안내원 : 베팅 금액은 가진 골드를 초과할 수 없어요...\n");
		}
		else if (bet == 0) {//베팅 금액을 0으로 했을 경우
			sys_print("안내원 : 베팅 금액은 0원일 수 없어요...\n");
		}
		else break;
	}
	
	a->gold -= bet;

	

	sys_print("안내원 : 어떤 결과를 예측하시나요?\n");//첼시60%무승부10%아스날30%
	sys_print("[1]첼블루FC 승\t\t[2]무승부\t\t[3]갱스날FC 승");
	sel1 = sys_select();

	ran = rand() % 100;

	if (0 <= ran < 60) {
		win = 1;//첼시 승
	}
	else if (60 <= ran < 70) {
		win = 2;//무승부
	}
	else if (70 <= ran < 100) {
		win = 3;//아스날 승
	}

	sys_print("나는 승부예측을 완료한 뒤, 근처의 펍에 들어가서 경기 결과를 기다렸다.\n");
	
	sys_gonext();
	sys_printstat(a);
	printf("........................................................................................................................\n");
	printf("....................  ..................................................................................................\n");
	printf("....................:^. .............................................................     ..  ..........................\n");
	printf("................... Y@B7 ..........................................................  :~75GBG5J!^^^^::...  ..............\n");
	printf(".....................?#@7 ............  .  ......................................:.75B&@@@@@@@@J^^^~~~~^^:  ............\n");
	printf("..................... :B@Y:   ....... ^GBGY. .................................. .. ?&@@@@@@@@#7::^^^^^~~?G5^  ..........\n");
	printf("...................... :B@&J:....     G@@@@~ ................................      .YGGGGGPGP~.:::^^^^^^~!B@Y. .........\n");
	printf("....................... .JB@@&###G55J7#@@&7  ..............................:.     .^..     ..^:::::^^^^^~~!B@B^ ........\n");
	printf("........................  .^PB#@@@@@@@@@@#!^.  ...........................^:.    ::        ..:^::::^^^^^~~~7P#B: .......\n");
	printf("...........................   .~B@@@@@@@@@@@#5:  .........................^..   ::        ...::^::::::^^~~!!!!Y? .......\n");
	printf("............................... !@@@@@@@@@@@@@#?~..      .................^::~7?!        ...::.!GBBGP5YJ!~~!!!7Y^ ......\n");
	printf("..............................  5@@@@@@@@@5^JG#@@#BGPYJ?5Y!: .......... ..:J#@@@B~  .......::.?#@@@@@@@@5~!!!!?57 ......\n");
	printf("............................ .~P@@@@@@@@@P    .^!??7!!!~~: ........  .:^!!:B@@@@@#?....::::::J&@@@@@@@@@B~!!!!?5? ......\n");
	printf(".........................  .~B@@@@@@@@@@#: ....           .....  ..:~7????:P@@@@@@@G^:^:::::7#@@@@@@@@@@B!!!!7?5! ......\n");
	printf(".......................  ^JB@@@@@@@@@@&5: .................  ..:~!7????JJY!!@@@@@@&7:::::::::!G@@@@@@@@&P!!!!!JP: ......\n");
	printf("...................   .7G@@@@@@@@@@@@@?  .............   ..^~!7????JJYYYJJ?~7P&@@@7.:::::^^^^::?#@@&BPJ7!!7775#! .......\n");
	printf("...............   .~?JB@@@@&@&P&@@@@@#~ ........   ..:^~!7???JJJYYYYJJ??????!^~7J?^^^^^^^^^^^^^^!J?7!!!!!!!!P&! ........\n");
	printf(".............  :!YB@@@#PJ!^^!^ #@@@@@J      ...:^~!77??JJYYYY5YYJJ??????JJJYY?~^^^~~^^^^^~~~~~~~!~!!!!!!!!~?5^ .........\n");
	printf(".............7G&@B?~^:.        !&@@@@!.:^^~!7??JJYY5555555YJJ??????JJJYYYYJJJ??7!~~~~~~~~~~~~~!!!!!!!!!~~^~~  ..........\n");
	printf("........... :GP?7!~~~~~~~~~~!!!!5P55YJYY55555PPP555YYJJJ????JJJYYYYYYJJJ???????JJJ?7!!5BGGPGGBBP?7!77!~^:.. ............\n");
	printf("..............   .:^~7?Y55555555YYYY555YYYYYYYYJJJYYYY5555555YYYJJ????????JJJYYYJ?7~::?PB#&&&&&&B5!~^:..................\n");
	printf("...................    .:^!7YPP555555555555PPPPPPPP555YYJJJ????????JJJYYYYJJ?7~^:.  .   ..::::::..    ..................\n");
	printf("........................  ^G&#5!~7?JJYYY5555YYYYYYYYYYYYYYYYYYYYYYJJ?77!^^:..   ..........      ........................\n");
	printf("......................... 5@#:     ...:^^~!!77?????J?????77!!~^^::...     ..............................................\n");
	printf("........................ !@@! ........                           .......................................................\n");
	printf("........................ :7~ ...........................................................................................\n\n");
	if (sel1 == win && win == 1) {//첼시승 맞춤
		sys_printdot();
		sys_print("해설 : ... 디디에 도둑바 선수의 멋있는 골이 터집니다.!!\n");
		sys_print("해설 : ... 아, 갱스날FC!! 오늘 운이 따르지 않습니다... 이걸 놓치다니요!!\n");
		sys_print("해설 : ... 디디에 도둑바 선수, 오늘 폼이 아주 좋은데요? 추가골을 성공시킵니다!!\n");
		sys_printdot();

		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 첼블루가 2:0으로 갱스날을 제압합니다!!\n\n");
		sys_print("맞췄다!!!\n");
		sys_print("승부 예측 보상으로 ");
		printf("%d", bet * 2);
		sys_print("골드를 획득하였다!\n\n");
		a->gold += bet * 2;
	}
	else if (sel1 == win && win == 2) {//무승부 맞춤
		sys_printdot();
		sys_print("해설 : ... 타이에리 헨리 선수의 환상적인 감아차기!! 갱스날이 1점 앞서나갑니다!\n");
		sys_print("해설 : ... 아, 갱스날FC!! 허무하게 PK를 내주는데요...\n");
		sys_print("해설 : ... 이든 해저드 선수가 PK를 성공시킵니다!!! 현재 스코어 1:1 !! \n");
		sys_printdot();

		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 오늘은 승자 없이 1:1 로 경기 마무리됩니다......\n\n");
		sys_print("맞췄다!!!\n");
		sys_print("승부 예측 보상으로 ");
		printf("%d", bet * 2);
		sys_print("골드를 획득하였다!\n\n");
		a->gold += bet * 2;
	}
	else if (sel1 == win && win == 3) {//아스날 맞춤
		sys_printdot();
		sys_print("해설 : ... 타이에리 헨리의 크로스~\n");
		sys_print("해설 : ... 러브 반 포르시의 멋진 헤딩골이 터집니다! 갱스날FC 1:0!!\n");
		sys_print("해설 : ... 오늘 첼블루FC 선수들 폼이 좋지 않은데요? 계속해서 기회를 놓칩니다....\n");
		sys_printdot();

		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 갱스날FC가 1:0으로 첼블루를 제압합니다!!\n\n");
		sys_print("맞췄다!!!\n");
		sys_print("승부 예측 보상으로 ");
		printf("%d", bet * 2);
		sys_print("골드를 획득하였다!\n\n");
		a->gold += bet * 2;
	}
	else if (sel1 != win && sel1 == 1) {//첼시승 골랐는데 틀림
		sys_printdot();
		sys_print("해설 : ... 타이에리 헨리의 크로스~\n");
		sys_print("해설 : ... 러브 반 포르시의 멋진 헤딩골이 터집니다! 갱스날FC 1:0!!\n");
		sys_print("해설 : ... 오늘 첼블루FC 선수들 폼이 좋지 않은데요? 계속해서 기회를 놓칩니다....\n");
		sys_printdot();
		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 갱스날FC가 1:0으로 첼블루를 제압합니다!!\n\n");
		
		sys_print("하... 이걸 틀리다니..\n");
		sys_print("결국 베팅금만 날렸네..이런\n");
	}
	else if (sel1 != win && sel1 == 2) {//무승부 골랐는데 틀림
		sys_printdot();
		sys_print("해설 : ... 디디에 도둑바 선수의 멋있는 골이 터집니다.!!\n");
		sys_print("해설 : ... 아, 갱스날FC!! 오늘 운이 따르지 않습니다... 이걸 놓치다니요!!\n");
		sys_print("해설 : ... 디디에 도둑바 선수, 오늘 폼이 아주 좋은데요? 추가골을 성공시킵니다!!\n");
		sys_printdot();
		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 첼블루가 2:0으로 갱스날을 제압합니다!!\n\n");
		sys_print("하... 이걸 틀리다니..\n");
		sys_print("결국 베팅금만 날렸네..이런\n");
	}
	else if (sel1 != win && sel1 == 3) {//아스날승 골랐는데 틀림
		sys_printdot();
		sys_print("해설 : ... 타이에리 헨리 선수의 환상적인 감아차기!! 갱스날이 1점 앞서나갑니다!\n");
		sys_print("해설 : ... 아, 갱스날FC!! 허무하게 PK를 내주는데요...\n");
		sys_print("해설 : ... 이든 해저드 선수가 PK를 성공시킵니다!!! 현재 스코어 1:1 !! \n");
		sys_printdot();
		sys_print("해설 : ...... 네 경기 종료됩니다!\n");
		sys_print("해설 : 결국 오늘은 승자 없이 1:1 로 경기 마무리됩니다......\n\n");
		sys_print("하... 이걸 틀리다니..\n");
		sys_print("결국 베팅금만 날렸네..이런\n");
	}
	sys_gonext();

	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}


int event_1dollar(player* a) // [5] give me 1dolor 이벤트
{
	system("cls");//이벤트 시작
	sys_printstat(a);
	PlaySound(TEXT("event_1dollar.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//1달러 이벤트 배경음악 출력
	Sleep(2000);

	srand((int)time(NULL));
	int sel_1 = 0;
	printf("                                                                              .....:::^::..                             \n");
	printf("                                                                        .^~7JYYY5PPP5PPPPYJJJ7!~^.                      \n");
	printf("                                                                    .~?55PGGGGGGGGGPGGPPPPPPPGPGP5J!:                   \n");
	printf("                                                                 .~J5PGGPPPPP555YYYYYYYYY555555PPPPPPJ~.                \n");
	printf("                                                               ~YPGPPPPPP5YYYYYJJJJ?????JJJJYYYYY55PGPJ~.               \n");
	printf("                                                              :JPGGGP555YYJJ?????777777?7?J???JYJYYYY5PP5J^             \n");
	printf("                                                            .?PGGGPP55YYJJ??77777!!!!!!!!!7!77??JJJJJYY5PPP7.           \n");
	printf("                                                          .?PGPPPP5YJJ?J??77!!!~~~~~~~~~!!~!777????JYYY5PP5J:           \n");
	printf("                                                          :JPGPGPP5YJJ???777!~~~~~^^^^~~~~!!!!!77???JJYY5PP5PY^         \n");
	printf("                                                         .?GGPGGPP55YJ???77!!~^^^:::::^^^^~~!!7???JJJYY55PPGGPY:        \n");
	printf("                                                         ~PGGGGGGP55YYJJ???77!!~^^::::^^~!?JY555YYJYY5Y5PPPPGG5?.       \n");
	printf("                                                        .?PPGGGP55555555555Y???77~~^^~!7?J5YJJ7!!!7?JJY55PPPPPGP!       \n");
	printf("                                                        ^5PPGGPP55YJ?????JJJJJJ??7!!~!7?JJJ???7!!7?JJJJ55PP5PGGPY:      \n");
	printf("                                                        ?PPPGPP5JYJJ??7777??JYYJJ77!!7?YY??????7777JJJJY55PP55GPP?      \n");
	printf("                                                       .JGPPPP5YJJJJJJJJJJJ??J55Y?77!7?5Y?7J55PGGPPP55YJY55PYJ5PP5:     \n");
	printf("                                                      ^5GG5555YY55PGGGGGP55J?P5J?7!!7??YYJYJJY5PP55555YYY55YJ5PP5~      \n");
	printf("                                                       ~PPGYY5555P5Y5555555YJJJJ?77!!7777???77?JY555YJJJYY55YJYPPP?     \n");
	printf("                                                       :PPPYY5Y55YYYJJJ?JJ?777?7!~~^^^~~!7?77!777!!7!!777?JY5JJPP5?     \n");
	printf("                                                       .5GPYY555J??7!!!7777??7777!~^^~!7??J7?J?77!!!!!777?JY5JJPGP?     \n");
	printf("                                                       .YGPJYP5YYJ?77777!?JY?YGGP5????JPGGPJYJJJ?777!!~~!7JY5Y?5GGY.    \n");
	printf("                                                       7PGJYPPYJJ7777?7?J?55YJYJYYYYYJ?JJJJ???J5J??7!~^^~?YP5J5GY?J?~.  \n");
	printf("                                                      .7Y55JYG5YJ7!7???YY??7???JJJ77??7!JJJ?77???YYJ?7!~^~7YP5J5YY5P557 \n");
	printf("                                                      ~P555JJP5J7~!??JYY?????JJJJJ!!???7JJ??77????YJ?7~~^~?5PYJYY55YY5~ \n");
	printf("                                                      !5Y555J55J!~7??YJ??7??JJJYYYYYYYY5YYJJ?77???YJ??!~~7Y55JJYY5JJYJ. \n");
	printf("                                                      !5YYY5JY5J77??J?????JY5PP555YYYJ??JJY55YJ??JJJ??7!?Y555JJJJYJ?J7. \n");
	printf("                                                      :J5YJYYY5Y????JJJYY5PP5Y7!!^^!~^~!^~7~?Y55YYYJ??JJYYY55JYJYYJJJ7  \n");
	printf("                                                       !YY?JJJ55J???JJYY5PY?!~?J555PP55P555JJ?YG5YYJ?JJJYY555JJ5JJJJY?  \n");
	printf("                                                       ^JJJ7JJ555YJJYYYY?55555PGPPPPPPPPPPPGGBBGJYY???JJYY5PYJ:~JYJJ57  \n");
	printf("                                                       :J??JJ!JP55YJYYY5?!GBBP55P5YYYYYYJ?JJJY5?JYY???JY55P5J!  .^!77:  \n");
	printf("                                                        :~~^  !YPP55YYYYY??J???~7~^^~^^~!~!777?JYYYJJJY5PP5YJ:          \n");
	printf("                                                              .!YPP55YYYYYYJ?77777777777777?JYYYYYJJJY5PP5J5~           \n");
	printf("                                                                ~YPP55YYYYY5YJJ?77!!!~!!77JYYYJJJJJYY5PPYJPJ            \n");
	printf("                                                                ^?5P555YJYYY555YYYYYYYYYYYJ???77?JY5P5JYPG^             \n\n");
	sys_print("길을 걸어가다가 덧니가 튀어나온 까만피부에 아이 하나가 내앞에 갑자기 나타났다.\n");
	sys_print("아이는 신발이 다 찢어져있고 옷은 누더기를 걸친 것 마냥 상태가 안좋다...\n");
	sys_print("아이는 울먹이는 얼굴로 나를 보고 말했다\n");
	sys_print("아이 : give me 1딸라 \n");
	sys_print("\n[1]준다 \t[2]무시한다\n");
	Sleep(100);
	sel_1 = sys_select();

	switch (sel_1) {
	case 1://1달러를 줄 경우 rand()함수로 0과 1중 하나를 무작위로 뽑아 결과를 나눈다.
		if ((rand() % 2) > 0)//50%확률로 힘 증가
		{
			sys_printdot();
			sys_print("아이에 손에 1달라를 쥐어주었다!\n");
			sys_print("아이는 덧니를 드러내며 환하게 웃으며 나에게 계속 고맙다고하였다\n");
			sys_print("아이는 보답인지 자기 주머니에서 사탕을꺼내 나에게 주었다\n");
			sys_print("이거, 먹어도 되는거겠지?\n");
			sys_print("?????!\n");
			sys_print("사탕을 먹자 갑자기 힘이 솟아오르는 것 같다!!!\n");
			sys_print("사탕을 먹고 힘이 3 증가한 기분이다!!\n");
			a->str += 3;
		}
		else//50%확률로 체력 증가
		{
			sys_printdot();
			sys_print("아이에 손에 1달라를 쥐어주었다!\n");
			sys_print("아이는 덧니를 드러내며 환하게 웃으며 나에게 계속 고맙다고하였다\n");
			sys_print("아이는 보답인지 자기 주머니에서 사탕을꺼내 나에게 주었다\n");
			sys_print("이거, 먹어도 되는거겠지?\n");
			sys_print(".......\n");
			sys_print("사탕은 그냥 먹을만했다\n");
			sys_print("사탕을 먹고 체력이 회복됐다.\n");
			a->hp += 1;
		}
		break;
	case 2://주지 않았을 경우
		if (((rand() % 5) + (a->dex)) > 10)//민첩이 높을 경우 성공
		{
			sys_print("나는 아이를 못본척하고 그냥 지나갔다.\n");
			sys_print("아이는 화가 났는지 뻬액 소리를 지르며 나에게 욕을했지만 나는 무시한채 그냥 지나갔다 \n");
			sys_print("그러던 중 소리를 지르던 아이가 갑자기 주머니에서 무언가를 꺼내 나에게 던졌다!!\n");
			sys_print("반응속도에 자신있었던 나는 아이가 던진것을 바로 낚아챘다..\n");
			sys_print("아이가 던진건 사탕인것같았다.\n");
			sys_print("나는 바로 사탕 포장을 깐 다음 입안에 넣었고, 아이는 더욱 화가 났는지 나에게 괴성을 지르며 욕을 한다...\n");
			sys_print("사탕은 그냥 먹을만했다\n");
			sys_print("사탕을 먹고 체력이 1 회복됐다.\n");
			a->hp += 1;
		}
		else//실패 시 체력 감소
		{
			sys_print("나는 아이를 못본채하고 그냥 지나갔다\n");
			sys_print("아이는 화가 났는지 뻬액 소리를 지르며 나에게 욕을했지만 나는 무시한채 그냥 지나갔다 \n");
			sys_print("그러던 중 소리를 지르던 아이가 갑자기 주머니에서 무언가를 꺼내 나에게 던졌다!!\n");
			sys_print("나는 아이가 던진것을 낚아챌려했지만 몸이 굼떠 그만 던진물건에 맞고말았다...\n");
			sys_print("아이가 던진건 사탕인것같았다.\n");
			sys_print("사탕을 머리에 맞아 이마에 혹이생겼다....\n");
			a->hp -= 1;
		}
		break;
	}

	sys_gonext();

	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);//사운드 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}



int event_star(player* a) // [6]별똥별이벤트
{
	system("cls");//이벤트 시작
	sys_printstat(a);
	PlaySound(TEXT("event_star.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//별똥별 배경음악 출력
	Sleep(2000);
	printf(".......................................................................::^~~~^^^^^~~~!7!~~~~~~~~~^^^^^^^^~~~~^:.........\n");
	printf("....................................................................::^~~~~^^^^^^~~~~~~~~~~~~~~^^^^^^~~~~~~^:...........\n");
	printf(".................................................................::^~~~~~~^^^^^^~~~~~~~~~~~~~^^^^^^^~!!!~:..............\n");
	printf("..............................................................::^~~~~~~~~^^^^^^~~~~~~~~~~~~~~~~~~~~~!!~:................\n");
	printf("............................................................:^~~~~~~~~~~^^~~~^~~~~~~~~~~~~~~~~~~~~!!~:...::::::::.......\n");
	printf(".........................................................:^^~~~~~~~~~^^~~~!!!!!~~~~~~~~^~~~~~~~~!!!!^~~~!!!!~~~~~~~~^:..\n");
	printf(".......................................................:^~~~~~~~~~~~~~!!!~!!!!!~~~~^^~~~~~~~~~!!7777!!!!!!7777777777!:..\n");
	printf("................:^^.................................:^^~~~~~~~~~~!!!77!!!~~~~~~~^^^^~~~~~~~~~!!777777???77???77?7!~::...\n");
	printf("...............:5YJ7~:............................:^^~~~~~~~~~~!!777!!~~~~~^~~~~~~~~~~~~~~!!!77???????J?????7!^^:.......\n");
	printf("................J5J???!^:.......................:^~~!?J?~^~~!!!!!77!!~~!~~~~~~!~~~~~~~!!!777???????JJJ?7!!~::...........\n");
	printf("................!P5?777!~~^::................:~!7JYPPGG?~~!!!!!!!!!!~!!!!77!!!!!!~!!!!7777???JJJJ??7!^::................\n");
	printf("................^5PPYJ!!!!!77~^:........::^!7YPGGGPP5PY~~!!!!!!!!!!!!7777??7!7777777777777?JJ??7~::.....................\n");
	printf("................^5PGG5?77!7!!!!!~^::^~!!7JYYJY55YJJJJJ!!!!!~!!!!!!77777?777777777?7?????777!~^:.........................\n");
	printf("................:5PPGPPJ?7??!7!!!!!JJJYYYYY5YJY?!!77!~~~~~^!!~~!7!!77!??7!!!!7!77!77??7!^::.............................\n");
	printf(".................YPPPPPPY??7?7777!75J?PYYPGP?777!!77~~!~~~~!!~~!7?7!!?777?7!7?77!!7~^^:.................................\n");
	printf(".................?PP55PP5Y??YJ???7?PYJGYYG5J7??7!777~!!!!!!!!~~77!77!!!7777!??7~^::...:.................................\n");
	printf(".................~YYY55555Y????J??Y5YJGYYP??JJ?777?7!!!!7777777?????7777777!~^:.........................................\n");
	printf("..................7JJY55PGP5YJJJJJ5PPPG5JJJJJ?77??7!!!!!77777??J???7777!~^:.............................................\n");
	printf("...............:^~!77JPPGBBGG5JJYY5P55J???777?777?!!!!777777???????7~^:.................................................\n");
	printf(".............:~7??7!!7J5GGGGGG5YYYP5J777!7?77JJ?JYY?77777777????7!^:....................................................\n");
	printf("..........:~?7777??777?Y55PPP555YJYJJ?JJJY5555P5PPPP5?7777?77!~^:.......................................................\n");
	printf(".......^7??7?????J???JY55PP5YYJ?J??JYPGPPGPPP55555PGG5?77~^:........................................................... \n");
	printf(".....:^~!???77????JJYY555GGGP5J7?YJ77??JJJJJY555555PGGBGJ^..............................................................\n");
	printf("..:~7?7!!777??JJY55PGGGGGGBPJJ???PP5J???!!?JJJYYYYY55PGPBG?:............................................................\n");
	printf("..75PPP55555Y55YY5PPPGGP5YY?7??JYGGPPYJ??777?777???JYY555GBP!...........................................................\n");
	printf("...:^~~!777?Y5YYYYYYYYYJY?77777?YPGGP55YJJ?777777??7?J?Y5GBBB5!:........................................................\n");
	printf(".............:::^^^!???????77777JPPGGP5PY??J7777?JJJ?JJJY5PGGBB5:.......................................................\n");
	printf("......................:????J?JJ?YPBBBBGGP5!!!~~~~!!!!~~!!!!!~~~~........................................................\n");
	printf(".......................:?JJJJJ??YPGBBBBBP!..............................................................................\n");
	printf("........................^JJ?JJJ?Y5GBBBBP^...............................................................................\n");
	printf(".........................^????JJ55PBBBJ:................................................................................\n");
	printf("..........................~J???YPPGBB?..................................................................................\n\n");

	srand((int)time(NULL));
	int sel_1 = 0;
	sys_print("밤 11시 산책을 하던 중 하늘을 올려다 보니 무언가가 반짝이기 시작했다.\n");
	sys_print("저거 별똥별 아니야?? 모처럼이니 소원이나 빌어볼까...\n");
	sys_print("나는 눈을 감고 소원을 생각하기 시작했다...\n");
	sys_print("\n[1]하느님 부자되게 해주세요!!!\t\t[2]건강하게 살고 싶어요.\n[3]헬린이를 탈줄하고 싶어요.\t\t[4]런던시내를 1시간만에 달리기로 완주하는게 내 꿈입니다.\n");
	//각 선택지에 따라 소원과 연관된 캐릭터의 능력치가 증가된다.
	Sleep(100);
	sel_1 = sys_select();
	sys_gonext();
	sys_printstat(a);
	switch (sel_1) {
	case 1:
		if ((rand() % 100) > 3)//97%확률로 골드 증가
		{
			sys_printdot();
			sys_print("띠링\n");
			sys_print("핸드폰에 알람이 왔다\n");
			sys_print("[스타코인 지정가 도달]\n");
			sys_print("이전에 구매해놓고 신경안쓰고있던 코인이 갑자기 올랐다!!\n");
			sys_print("나는 헐레벌떡 주식을 판매했고 수익금을 받았다.\n");
			sys_print("갑자기 뭐지? 설마 내 소원이 진짜 이뤄진건가??\n");
			sys_print("기분이 묘했지만 꽁돈이 생긴나는 기분좋게 집에 돌아갔다.\n");
			sys_print("골드가 50 증가했다.\n");
			a->gold += 50;
		}
		else//3%확률로 체력 감소(게임 오버)
		{
			sys_printdot();
			sys_print("콰쾅\n");
			sys_print("?????\n");
			sys_print("갑자기 하늘에 먹구름이 생기더니 벼락이 내 근처로 내려치기 시작했다!!\n");
			sys_print("깜짝 놀란 나는 헐레벌떡 도망치기 시작했지만 나를 맞추기로 작정이라도 한 듯이 내 근처로만 벼락이 내려친다 \n");
			sys_print("(쿵~~)\n");
			sys_print("결국 벼락을 피하지못하고 정통으로 맞아버렸고 나는 소리를 지르며 의식이 흐릿해진다...\n");
			sys_print("평소에 착하게 살걸 그랬어....\n");
			sys_print("체력이 30 감소했습니다.\n");
			a->hp -= 30;
		}
		break;
	case 2:
		if ((rand() % 100) > 3)//97%확률로 체력 증가
		{
			sys_printdot();
				sys_print("?????\n");
				sys_print("갑자기 컨디션이 좋아지는 기분이 들고 피로가 싹 가시는 느낌이다!!\n");
				sys_print("아침부터 있었던 몸살 기운도 싹 사라진 것 같다!\n");
				sys_print("갑자기 뭐지? 설마 내 소원이 진짜 이뤄진건가??\n");
				sys_print("기분이 묘했지만 컨디션이 좋아진 나는 기분좋게 집에 돌아갔다,\n");
				sys_print("체력이 2 증가했습니다.\n");
				a->hp += 2;
		}
		else//3%확률로 체력 감소(게임 오버)
		{
			sys_printdot();
			sys_print("콰쾅\n");
			sys_print("?????\n");
			sys_print("갑자기 하늘에 먹구름이 생기더니 벼락이 내 근처로 내려치기 시작했다!!\n");
			sys_print("깜짝 놀란 나는 헐레벌떡 도망치기 시작했지만 나를 맞추기로 작정이라도 한 듯이 내 근처로만 벼락이 내려친다 \n");
			sys_print("(쿵~~)\n");
			sys_print("결국 벼락을 피하지못하고 정통으로 맞아버렸고 나는 소리를 지르며 의식이 흐릿해진다...\n");
			sys_print("평소에 착하게 살걸 그랬어....\n");
			sys_print("체력이 30 감소했습니다.\n");
			a->hp -= 30;
		}
		break;
	case 3:
		if ((rand() % 100) > 3)//97%확률로 힘 증가
		{
			sys_printdot();
				sys_print("띠링\n");
				sys_print("핸드폰에 알람이 왔다\n");
				sys_print("[유어프로틴] 축하드립니다! 신상품 이벤트에 당첨되셨습니다!\n");
				sys_print("이전에 신청하고 신경 안쓰고 있던 프로틴 이벤트에 당첨되었다!\n");
				sys_print("나는 헐레벌떡 우리집 주소를 입력했고 내일까지 신상 프로틴이 집에 배달된다했다..\n");
				sys_print("갑자기 뭐지? 설마 내 소원이 진짜 이뤄진건가??\n");
				sys_print("기분이 묘했지만 공짜 프로틴으로 단백질이 늘어날 생각이 생긴나는 기분좋게 집에 돌아갔다.\n");
				sys_print("힘이 2 증가했습니다.\n");
				a->str += 2;
		}
		else//3%확률로 체력 감소(게임 오버)
		{
			sys_printdot();
			sys_print("콰쾅\n");
			sys_print("?????\n");
			sys_print("갑자기 하늘에 먹구름이 생기더니 벼락이 내 근처로 내려치기 시작했다!!\n");
			sys_print("깜짝 놀란 나는 헐레벌떡 도망치기 시작했지만 나를 맞추기로 작정이라도 한 듯이 내 근처로만 벼락이 내려친다 \n");
			sys_print("(쿵~~)\n");
			sys_print("결국 벼락을 피하지못하고 정통으로 맞아버렸고 나는 소리를 지르며 의식이 흐릿해진다...\n");
			sys_print("평소에 착하게 살걸 그랬어....\n");
			sys_print("체력이 30 감소했습니다.\n");
			a->hp -= 30;
		}
		break;
	case 4:
		if ((rand() % 100) > 3)//97%확률로 민첩 증가
		{
			sys_printdot();
				sys_print("띠링\n");
				sys_print("핸드폰에 알람이 왔다\n");
				sys_print("[CREAM] 축하드립니다! 이번 느발란스993 응모 이벤트에 당첨되셨습니다!\n");
				sys_print("이전에 신청해놓고 신경 안쓰고 있던 응모 이벤트에 당첨되었다!\n");
				sys_print("나는 헐레벌떡 우리집 주소를 입력했고 내일까지 느발란스993이 집에 배달된다했다..\n");
				sys_print("갑자기 뭐지? 설마 내 소원이 진짜 이뤄진건가??\n");
				sys_print("기분이 묘했지만 낡아빠진 원래 신발 대신 새 신발을 신고 이전보다 빠르게 달릴 수 있다는 생각에 벌써기분이 좋아진 나는 휘파람을 불며 집에 돌아갔다.\n");
				a->dex += 2;
		}
		else//3%확률로 체력 감소(게임 오버)
		{
			sys_printdot();
			sys_print("콰쾅\n");
			sys_print("?????\n");
			sys_print("갑자기 하늘에 먹구름이 생기더니 벼락이 내 근처로 내려치기 시작했다!!\n");
			sys_print("깜짝 놀란 나는 헐레벌떡 도망치기 시작했지만 나를 맞추기로 작정이라도 한 듯이 내 근처로만 벼락이 내려친다 \n");
			sys_print("(쿵~~)\n");
			sys_print("결국 벼락을 피하지못하고 정통으로 맞아버렸고 나는 소리를 지르며 의식이 흐릿해진다...\n");
			sys_print("평소에 착하게 살걸 그랬어....\n");
			sys_print("체력이 30 감소했습니다.\n");
			a->hp -= 30;
		}
		break;
	}



	sys_gonext();
	Sleep(300);
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);
	system("cls");//이벤트 종료
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}



void event_armwrestle(player* a)//[7]팔씨름 이벤트
{
	PlaySound(TEXT("event_armwr.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//팔씨름 배경음악 출력
	system("cls");
	sys_printstat(a);
	Sleep(2000);

	srand((int)time(NULL));
	int sel_1 = 0;
	printf("                    &#BB&G!^~~!!!!!!!!!777777777777??JJJYPGBB##&&@@@@@@@@@#&&                       \n");
	printf("                     ###Y^:^~!!~~!!7??JJYYYYYJJ??77??JYY5PGBBBBB#&&@@@@@@@@@&&                      \n");
	printf("                     &#J::^~!!!~7JY5PPGGGGP55YY5YYYJ??JJJ5PGGGGGBB#&&@@@@@@@@&#                     \n");
	printf("                     &?:^~!???7?Y5PPGGGP5YJJJJJY5PPP5YJ???Y5PGGBBBB##&&@@@@@@@&#                    \n");
	printf("                    &J~?YYYY5YY55PPPP5YYY5PPGPPPP5PPPP5YJ??JY5PBBBBB###&@@@@@@&B&                   \n");
	printf("                    5YGGGGPPP5YYY5PP55PG##&&#PPGGGPPP5YYYYJJJJYPBBBBB###&@@@@@&&#                   \n");
	printf("                   G7?YY555PPY!7?Y55PPGBGPGP5YYJJJ???????JYYJJY5GBBBB####&@@@&&#B&                  \n");
	printf("                  &?^7YY555557~!?JJJYJJJJJYYYYYJ???77!77?JY555Y5PBB#BBB##&&@&&&#B#                  \n");
	printf("                  &?JBB##BGP~^~!77777777?????????????JJJJYY5P55PPBB##BBGGGGBB#&#B&                  \n");
	printf("                   G#BGBGY7~^^~~!77?JJ?77!77777???JJYYY5555555PPGBB#BGP5YPGBGG##B#                  \n");
	printf("                    &5!?J7~!7??????77JY55JJ???????JJYY555YYY5555PGB#BPPPPPBGGBBGBB&                 \n");
	printf("                    ?!~!!J5PPPB####BPP55P5YYJJJJYYY5555YYYYYY555PBBP555GG5JY5GGP#                   \n");
	printf("                   B^::!PBBBGGBBBBBBBG5Y5P55YYYYYYY5YYY55555555PGGBPPY?5BBG5Y5GG&                   \n");
	printf("                   ?..~JG#&#BBGGP555YYJJ?JY5555YYYYYYYYY5555555PGGBGPY5PGPGPYYPB&                   \n");
	printf("                  &!^!Y5GPJ?JYJYYYJ??JYYYJJJYYYYJYYYYYYY5555555PGBBBGPP5YJYPPPB#                    \n");
	printf("                   ?7J555?!?5PGBBBBBG55PPP5JJJJJJJJYYYY5555P555PGBBGGP5YJJJPPB#&                    \n");
	printf("                   P?YYJ??B##BP55Y5PPGGP55YJJJ??JJYYYY555555P55PGBBG55YYY5PG##&                     \n");
	printf("                   #?JJJJPPJ???JJJJJJJ???JJJJJJJJYYY5555555PPPPGBBB####BB&@@&&                      \n");
	printf("                    Y7??PY?YY5YYYJJ????????JYYYYYYY5555PPPPPPGBBBBGBB##B#@@@&&                      \n");
	printf("                    B7!7J7??JJJJ?JJJJJJJJJJJJJYYY5555PPPPGGGBB###GGGBBBB&@@&&                       \n");
	printf("                    &J!7!!7~!7????JJJYYJJJJJJYY5555PPPPGBB#####&#BGGGGGB&@&&                        \n");
	printf("                     P7?!77!?YYJJJ???????JJJY5PPPGGGGGBB##&######BGGGGPG&@&&                        \n");
	printf("                     #??77!?5P5PPP55Y55YYY5PGGBGGBBB####&&&&&&&#BBGGGGPP#&&                         \n");
	printf("                      BJ??J5GGGGBBBBGBBGGGBB########&&&&&&######BGGGGGPP#                           \n");
	printf("                       B55PGB##############&&&&&&&&&&&&########BBGGPGGPP&                           \n");
	printf("                        #GGB##&&&&&#&&&&&&&&&&&&&&&&########&#BBGGGPGGPP#                           \n");
	printf("                         &####&&&&&&&&&&&&&&&&&&&&&&######&##BBGGGPGGGGGG#                          \n");
	printf("                             &&@&#&&&&&&&&&&&&&&&&#########BBGGGGGGGGGGGGG&                         \n");
	printf("                               BYJP##&&&&&&&&&&#########BBBGGPGGGGGGGBBBBGGB&                       \n");
	printf("                             #YJ??JG&####&&&&######BBBBBBGGGPPPPPGGGGBBBGGGPGG#                     \n");
	printf("                            B??J??J5#@&BB##&#######BBBBBBGGGPPPPPGGBBBGGGGGGPPPG                    \n");
	printf("                            Y7???J5PPB@@###&&&&&####BBBBBBBGGGGGGGGBBGGGGGGBP55PB##&                \n");
	printf("                           #J?JJY5PP5YG@@@&&&&&&&&##BBBBBBBGGGGGBBGBBBBGGGBBBGB#G555PGB#&           \n");
	printf("                        #GJ?YPGP5555555B@@@@&&##&&&###BBBBBGGB####B#BBBBBBBB###BGPP5555555PG#&      \n");
	printf("                    &BPYJJYPPGGBG555PP55G#&@@&##&&&##B#BBB####&###BBBBBBBBB##BGGGGBP5555555555PPGB#&\n");
	printf("\n");

	sys_print("뭘 쳐다봐!!! 구경났어???\n");
	sys_print("사람들의 비명소리에 놀라 뒤를 돌아보니 K타운 갱스터 HASON GANG의 두목이 마체테를 들고 난동을 피우는 중이다.\n");
	sys_print("어떡할까?\n");
	sys_print("\n[1]도망간다\t[2]구경한다\t[3]맞서 싸운다\n");
	Sleep(100);
	sel_1 = sys_select();

	switch (sel_1) {
	case 1://도망간다 선택 시 
		if (((rand() % 5) + (a->dex)) > 8)//민첩이 높을 경우 성공확률 증가
		{
			sys_printdot();
			sys_print("그래... 안전이 최고지!\n");
			sys_print("휴~ 도망에 성공하였다\n");
			sys_printdot();
			Sleep(300);
		}
		else//실패 시 골드 감소
		{
			sys_printdot();
			printf("HASON GANG : ");
			sys_print("야 거기 너! 거기 서봐\n");
			sys_print("(뭐지?) 큰일났다.\n");
			printf("HASON GANG : ");
			sys_print("거기 너 10골드만 내놔봐 아이스크림 사먹게\n");
			sys_print("돈을 10골드 빼앗겼다. 마체테를 든 갱 두목을 상대로 이 정도면 다행이다.\n");
			sys_printdot();
			Sleep(300);
			a->gold -= 10;
		}
		break;

	case 2://구경한다 선택 시
		sys_printdot();
		printf("\n!!!!!!!!!!콱!!!!!!!!!!\n");
		printf("HASON GANG : ");
		sys_print("야 거기 너! 구경났어?\n");
		sys_print("멱살을 잡혔다!\n");
		sys_print("(멱살을 잡히지 않기 위해 팔에 힘을 주기 시작한다)\n");
		sys_printdot();
		Sleep(300);
		game_armwrestle(a);//팔씨름 미니게임 호출
		break;

	case 3://맞서 싸운더 선택 시
		if (((rand() % 5) + (a->str)) > 8)//힘이 높으면 상대방이 도망감
		{
			sys_printdot();
			printf("나 : ");
			sys_print("나 여기 아트박스 사장인데... ");
			sys_print("죽을 것 같으면 벨 눌러라잉~\n");
			printf("HASON GANG : ");
			sys_print("죄송합니다. 당신을 추앙해요... 돈 드릴게요\n");
			sys_print("100골드를 받았다. 내 근육량을 보고 놀랐나보다.\n");
			sys_printdot();
			Sleep(300);
			a->gold += 100;
		}
		else//그렇지 않을 경우 팔씨름 호출
		{
			sys_printdot();
			printf("나 : ");
			sys_print("진실의 방으로\n");
			sys_print("(싸움이 시작된다!!!)\n");
			sys_printdot();
			Sleep(300);
			game_armwrestle(a);
		}
		break;
	}
	sys_gonext();
	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}



void event_engvskorea(player* a)//[8]한국vs잉글랜드 승부예측 이벤트
{
	PlaySound(TEXT("event_sportstoto.wav"), NULL, SND_FILENAME | SND_ASYNC | SND_LOOP);//챔피언스리그 배경음악 재생
	system("cls");//이벤트 시작
	sys_printstat(a);
	Sleep(2000);

	srand((int)time(NULL));
	int sel_1 = 0;
	printf("........................................................................................................................\n");
	printf("....................  ..................................................................................................\n");
	printf("....................:^. .............................................................     ..  ..........................\n");
	printf("................... Y@B7 ..........................................................  :~75GBG5J!^^^^::...  ..............\n");
	printf(".....................?#@7 ............  .  ......................................:.75B&@@@@@@@@J^^^~~~~^^:  ............\n");
	printf("..................... :B@Y:   ....... ^GBGY. .................................. .. ?&@@@@@@@@#7::^^^^^~~?G5^  ..........\n");
	printf("...................... :B@&J:....     G@@@@~ ................................      .YGGGGGPGP~.:::^^^^^^~!B@Y. .........\n");
	printf("....................... .JB@@&###G55J7#@@&7  ..............................:.     .^..     ..^:::::^^^^^~~!B@B^ ........\n");
	printf("........................  .^PB#@@@@@@@@@@#!^.  ...........................^:.    ::        ..:^::::^^^^^~~~7P#B: .......\n");
	printf("...........................   .~B@@@@@@@@@@@#5:  .........................^..   ::        ...::^::::::^^~~!!!!Y? .......\n");
	printf("............................... !@@@@@@@@@@@@@#?~..      .................^::~7?!        ...::.!GBBGP5YJ!~~!!!7Y^ ......\n");
	printf("..............................  5@@@@@@@@@5^JG#@@#BGPYJ?5Y!: .......... ..:J#@@@B~  .......::.?#@@@@@@@@5~!!!!?57 ......\n");
	printf("............................ .~P@@@@@@@@@P    .^!??7!!!~~: ........  .:^!!:B@@@@@#?....::::::J&@@@@@@@@@B~!!!!?5? ......\n");
	printf(".........................  .~B@@@@@@@@@@#: ....           .....  ..:~7????:P@@@@@@@G^:^:::::7#@@@@@@@@@@B!!!!7?5! ......\n");
	printf(".......................  ^JB@@@@@@@@@@&5: .................  ..:~!7????JJY!!@@@@@@&7:::::::::!G@@@@@@@@&P!!!!!JP: ......\n");
	printf("...................   .7G@@@@@@@@@@@@@?  .............   ..^~!7????JJYYYJJ?~7P&@@@7.:::::^^^^::?#@@&BPJ7!!7775#! .......\n");
	printf("...............   .~?JB@@@@&@&P&@@@@@#~ ........   ..:^~!7???JJJYYYYJJ??????!^~7J?^^^^^^^^^^^^^^!J?7!!!!!!!!P&! ........\n");
	printf(".............  :!YB@@@#PJ!^^!^ #@@@@@J      ...:^~!77??JJYYYY5YYJJ??????JJJYY?~^^^~~^^^^^~~~~~~~!~!!!!!!!!~?5^ .........\n");
	printf(".............7G&@B?~^:.        !&@@@@!.:^^~!7??JJYY5555555YJJ??????JJJYYYYJJJ??7!~~~~~~~~~~~~~!!!!!!!!!~~^~~  ..........\n");
	printf("........... :GP?7!~~~~~~~~~~!!!!5P55YJYY55555PPP555YYJJJ????JJJYYYYYYJJJ???????JJJ?7!!5BGGPGGBBP?7!77!~^:.. ............\n");
	printf("..............   .:^~7?Y55555555YYYY555YYYYYYYYJJJYYYY5555555YYYJJ????????JJJYYYJ?7~::?PB#&&&&&&B5!~^:..................\n");
	printf("...................    .:^!7YPP555555555555PPPPPPPP555YYJJJ????????JJJYYYYJJ?7~^:.  .   ..::::::..    ..................\n");
	printf("........................  ^G&#5!~7?JJYYY5555YYYYYYYYYYYYYYYYYYYYYYJJ?77!^^:..   ..........      ........................\n");
	printf("......................... 5@#:     ...:^^~!!77?????J?????77!!~^^::...     ..............................................\n");
	printf("........................ !@@! ........                           .......................................................\n");
	printf("........................ :7~ ...........................................................................................\n\n");
	sys_print("띠링~\n");
	sys_print("아침 8시, 핸드폰에 깔려있던 스포츠티비 앱에서 알람이왔다.\n");
	sys_print("드디어 시작된 월드컵 조별예선 32강 잉글랜드 vs 대한민국 오늘 낮 16시\n");
	sys_print("띠링~\n");
	sys_print("이어서 핸드폰에 또다른 알람이 왔다\n");
	sys_print("런던 bet24/7 : 잉글랜드 vs 대한민국 승부예측 이벤트!!\n");
	sys_print("평소 심심풀이로 이용하던 승부예측 앱에서 이 경기에 대한 예측을 진행하나보다.\n");
	sys_print("잉글랜드 1.5배, 한국 4배, 배팅액 50골드!.\n");
	sys_print("잉글랜드가 더 전력이 강하지만, 한국이 배당이 더 높아...\n");
	sys_print("일확천금을 노릴까, 안전하게 베팅할까, 어떡하지...?\n");
	sys_print("\n[1]객관적인 전력이 더 높은 잉글랜드 승!!\t[2]자랑스런 대한민국 국가대표 승!!\t[3]돈을 걸지않는다.\n");
	Sleep(100);
	sel_1 = sys_select();
	switch (sel_1) {
	case 1://잉글랜드 승 골랐을 경우
		if ((rand() % 10) > 1)//80% 확률로 잉글랜드 승리
		{
			sys_printdot();
			sys_print("허리케인의 골!!!\n");
			sys_print("잉글랜드, 한국을 몰아붙이고 있습니다.\n");
			sys_print("그러던 순간, 박시정 선수의 만회골이 작렬합니다!!\n");
			sys_print("아.. 하지만 경기가 거의 끝나가고 있는데요... 레프리의 휘슬과 함께 경기 종료됩니다.\n");
			sys_print("스코어 3대1 잉글랜드, 대한민국을 상대로 무난하게 승리를 가져갑니다!!\n");
			sys_print("와!!!!! 이겼다!!!!!... 그렇지만... \n");
			sys_printdot();
			sys_print("돈은 벌었지만, 내가 뛰었으면 달라졌을까...?\n");
			a->gold += 25;
		}
		else//잉글랜드 승 골랐는데 졌을 경우
		{
			sys_printdot();
			sys_print("아 이게뭐죠???!!\n");
			sys_print("잉글랜드의 맹과이어 선수, 박시정 선수에게 위협적인 백태클을 걸었습니다.\n");
			sys_print("카드가 나올 것으로 예상되는 가운데... 아 레프리!!\n");
			sys_print("레드카드를 선언합니다!! 대한민국, 경기가 끝나기 직전에 PK를 얻어냅니다!!!!\n");
			sys_print("이청영선수 골!! 대한민국, 잉글랜드를 1대0으로 잡고 대이변을 만들어냅니다!!\n");
			sys_print("와!!!!! 이겼다!!!!!\n");
			sys_printdot();
			sys_print("비록 돈은 잃었지만 기분이 썩 나쁘지는 않다. 나도 하루빨리 국가대표가 되고싶어!!\n");
			a->gold -= 50;
		}
		break;
	case 2://대한민국 승 골랐을 경우
		if ((rand() % 10) > 7)//20% 확률로 대한민국 승리
		{
			sys_printdot();
			sys_print("아 이게뭐죠???!!\n");
			sys_print("잉글랜드의 맹과이어 선수, 박시정 선수에게 위협적인 백태클을 걸었습니다.\n");
			sys_print("카드가 나올 것으로 예상되는 가운데... 아 레프리!!!\n");
			sys_print("레드카드를 선언합니다!! 대한민국, 경기가 끝나기 직전에 PK를 얻어냅니다!!!!\n");
			sys_print("이청영선수 골!! 대한민국, 잉글랜드를 1대0으로 잡고 대이변을 만들어냅니다!!\n");
			sys_print("와!!!!! 이겼다!!!!!\n");
			sys_printdot();
			sys_print("돈은 벌었지만, 내가 없어도 이길 수 있구나... ...\n");
			a->gold += 150;
		}
		else//한국 승 골랐는데 잉글랜드 승리할 경우
		{
			sys_printdot();
			sys_print("허리케인의 골!!!\n");
			sys_print("잉글랜드, 한국을 몰아붙이고 있습니다.\n");
			sys_print("그러던 순간, 박시정 선수의 만회골이 작렬합니다!!\n");
			sys_print("아.. 하지만 경기가 거의 끝나가고 있는데요... 레프리의 휘슬과 함께 경기 종료됩니다.\n");
			sys_print("스코어 3대1 잉글랜드, 대한민국을 상대로 무난하게 승리를 가져갑니다!!\n");
			sys_printdot();
			sys_print("돈도 잃고, 경기도 지고, 정말 답답하다. 내가 빨리 국가대표가 되야겠어!!\n");
			a->gold -= 50;
		}
		break;
	case 3://베팅하지 않을 경우
	{
		sys_printdot();
		sys_print("에휴, 그래, 이런거 할 여유가 어디있다고.\n");
		sys_print("위험한 행동은 최대한 줄이자. 더이상 이렇게 한량처럼 살 순 없어!!\n");
		sys_print("한숨을 내쉬고 핸드폰을 닫았다.\n");
		sys_printdot();
	}
	break;
	}
	sys_gonext();
	Sleep(300);
	system("cls");//이벤트 종료
	PlaySound(NULL, NULL, SND_PURGE | SND_NOWAIT | SND_ASYNC);
	sys_playerstat(a);//이벤트 결과 스탯을 사용자에게 알려줌
	sys_checkend(a);//이벤트 종료 시 엔딩조건 달성했는지 확인
	sys_gonext();
}