//팔씨름 미니게임

#include "header.h"

int game_armwrestle(player* a)
{
	char* space;
	space = calloc(1024, sizeof(char)); // 연타를 입력받을 문자열 space 동적할당
	Sleep(300);
	system("cls");
	int i = 0, j;
	clock_t start, end;
	char c;
	double pst;
	int winsize;

	srand((int)time(NULL));

	winsize = rand() % 21 + 120; // 승패 기준이 될 연타량 120~140 

	sys_print("팔씨름이 3초 후 시작됩니다!\n");

	for (j = 3; j > 0; j--)
	{
		system("cls");
		printf("팔씨름이 3초 후 시작됩니다!\n");
		printf("                                                          .:\n");
		printf("                                                    ..:~7?J?:\n");
		printf("                                            .^!7!^7Y5P5YJJJ?!^.  \n");
		printf("                                      .^~~!?YYJ??JY55YJJJJJ?77~\n");
		printf("                                    :7?JJ?7???J5PP5YYJJJ?77!!!~::.\n");
		printf("                                    !JJYY555PGBGP55YJ?77!!!7?J?777^\n");
		printf("                                  .^~J555555JGG55YJ7!!!77?JJJ?77!~^\n");
		printf("                                 :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.\n");
		printf("                                 .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.\n");
		printf("                                .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.\n");
		printf("                               .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^\n");
		printf("                                :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.\n");
		printf("                               .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.\n");
		printf("                               .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.\n");
		printf("                               .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.\n");
		printf("                            .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.\n");
		printf("                         .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..\n");
		printf("                       :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.\n");
		printf("                    .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.\n");
		printf("                 .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.\n");
		printf("              :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^::\n");
		printf("           :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!!\n");
		printf("       .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!!\n");
		sys_gotoxy(80, 24);
		printf("\n%50d", j);
		Sleep(1000);
	}

	int arm = 0;
	start = clock();
	pst = 0;
	while (1) // 반복
	{
		if ((arm == 0) && (pst < 4)) // 시간이 지나면서 화면 출력이 조금 더 역동적으로 보이게끔 함
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("                                                          .:\n");
			printf("                                                    ..:~7?J?:\n");
			printf("                                            .^!7!^7Y5P5YJJJ?!^.  \n");
			printf("                                      .^~~!?YYJ??JY55YJJJJJ?77~\n");
			printf("                                    :7?JJ?7???J5PP5YYJJJ?77!!!~::.\n");
			printf("                                    !JJYY555PGBGP55YJ?77!!!7?J?777^\n");
			printf("                                  .^~J555555JGG55YJ7!!!77?JJJ?77!~^\n");
			printf("                                 :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.\n");
			printf("                                 .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.\n");
			printf("                                .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.\n");
			printf("                               .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^\n");
			printf("                                :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.\n");
			printf("                               .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.\n");
			printf("                               .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.\n");
			printf("                               .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.\n");
			printf("                            .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.\n");
			printf("                         .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..\n");
			printf("                       :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.\n");
			printf("                    .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.\n");
			printf("                 .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.\n");
			printf("              :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^::\n");
			printf("           :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!!\n");
			printf("       .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!!\n");
			arm = 1;
		}
		else if ((arm == 1) && (pst < 4))
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("                                                            .:\n");
			printf("                                                      ..:~7?J?:\n");
			printf("                                              .^!7!^7Y5P5YJJJ?!^.  \n");
			printf("                                        .^~~!?YYJ??JY55YJJJJJ?77~\n");
			printf("                                      :7?JJ?7???J5PP5YYJJJ?77!!!~::.\n");
			printf("                                      !JJYY555PGBGP55YJ?77!!!7?J?777^\n");
			printf("                                    .^~J555555JGG55YJ7!!!77?JJJ?77!~^\n");
			printf("                                   :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.\n");
			printf("                                   .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.\n");
			printf("                                  .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.\n");
			printf("                                 .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^\n");
			printf("                                  :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.\n");
			printf("                                 .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.\n");
			printf("                                 .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.\n");
			printf("                                 .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.\n");
			printf("                              .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.\n");
			printf("                           .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..\n");
			printf("                         :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.\n");
			printf("                      .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.\n");
			printf("                   .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.\n");
			printf("                :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^::\n");
			printf("             :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!!\n");
			printf("         .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!!\n");
			arm = 0;
		}
		else if ((arm == 0) && (4 <= pst) && (pst <= 7))
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("                                         o                .:                       o                 \n");
			printf("             o                      o               ..:~7?J?:        o                        o      \n");
			printf("                      o                     .^!7!^7Y5P5YJJJ?!^.                                      \n");
			printf("        o                             .^~~!?YYJ??JY55YJJJJJ?77~                       o              \n");
			printf("               o           o        :7?JJ?7???J5PP5YYJJJ?77!!!~::.         o                     o   \n");
			printf("                                    !JJYY555PGBGP55YJ?77!!!7?J?777^                                  \n");
			printf("     o                            .^~J555555JGG55YJ7!!!77?JJJ?77!~^                       o          \n");
			printf("                           o     :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.         o                      \n");
			printf("            o                    .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.              o         o      \n");
			printf("                                .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.                               \n");
			printf("                               .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^                              \n");
			printf("                  o             :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.     o           o           \n");
			printf("     o                         .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.                        o     \n");
			printf("                         o     .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.           o                 \n");
			printf("             o                 .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.                          \n");
			printf("                            .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.                      \n");
			printf("    o            o       .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..          o       \n");
			printf("                       :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.               \n");
			printf("                    .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.       o   \n");
			printf("          o      .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.      \n");
			printf("              :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^:: \n");
			printf("           :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!! \n");
			printf("       .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!! \n");
			arm = 1;
		}
		else if ((arm == 1) && (4 <= pst) && (pst <= 7))
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("                                           o                .:                       o                 \n");
			printf("               o                      o               ..:~7?J?:        o                        o      \n");
			printf("                      o                     .^!7!^7Y5P5YJJJ?!^.                                      \n");
			printf("          o                             .^~~!?YYJ??JY55YJJJJJ?77~                       o              \n");
			printf("                 o           o        :7?JJ?7???J5PP5YYJJJ?77!!!~::.         o                     o   \n");
			printf("                                      !JJYY555PGBGP55YJ?77!!!7?J?777^                                  \n");
			printf("       o                            .^~J555555JGG55YJ7!!!77?JJJ?77!~^                       o          \n");
			printf("                             o     :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.         o                      \n");
			printf("              o                    .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.              o         o      \n");
			printf("                                  .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.                               \n");
			printf("                                 .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^                              \n");
			printf("                    o             :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.     o           o           \n");
			printf("       o                         .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.                        o     \n");
			printf("                           o     .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.           o                 \n");
			printf("               o                 .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.                          \n");
			printf("                              .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.                      \n");
			printf("      o            o       .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..          o       \n");
			printf("                         :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.               \n");
			printf("                      .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.       o   \n");
			printf("            o      .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.      \n");
			printf("                :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^:: \n");
			printf("             :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!! \n");
			printf("         .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!! \n");
			arm = 0;
		}
		else if ((arm == 0) && (7 < pst) && (pst <= 10))
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("             ░                ░            ░        ░    .:     ░        ░               ░        ░      \n");
			printf("     ░            ░             ░       ░             ..:~7?J?:                  ░                ░      \n");
			printf("           ░               ░          ░      .^!7!^7Y5P5YJJJ?!^.        ░      ░           ░             \n");
			printf("       ░          ░            ░        .^~~!?YYJ??JY55YJJJJJ?77~               ░         ░       ░      \n");
			printf("                       ░        ░     !JJYY555PGBGP55YJ?77!!!7?J?777^             ░            ░      ░  \n");
			printf("         ░     ░           ░         .^~J555555JGG55YJ7!!!77?JJJ?77!~^         ░           ░             \n");
			printf("     ░                           :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.       ░                ░      ░    \n");
			printf("            ░         ░       ░     .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.           ░                    \n");
			printf("     ░          ░                .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.       ░           ░              \n");
			printf("       ░          ░       ░      .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^          ░                ░    \n");
			printf("                        ░       :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.   ░                   ░         \n");
			printf("    ░       ░                ░    .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.        ░      ░               \n");
			printf("                     ░       .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.       ░                ░      ░   \n");
			printf("     ░          ░       ░        .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.        ░     ░             \n");
			printf("             ░               .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.                  ░      \n");
			printf("    ░                   .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..░       ░          ░   \n");
			printf("      ░         ░   ░    :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.      ░     ░    \n");
			printf("           ░         .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.      ░       \n");
			printf("                 .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.    ░  ░  \n");
			printf("   ░     ░       :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^::  \n");
			printf("      ░    :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!!  ░  \n");
			printf("   ░  .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!! ░    \n");
			arm = 1;
		}
		else if ((arm == 1) && (7 < pst) && (pst <= 10))
		{
			system("cls");
			printf("팔씨름 시작(space bar 연타하시오)!\n");
			printf("               ░                ░            ░        ░    .:     ░        ░               ░        ░      \n");
			printf("       ░            ░             ░       ░             ..:~7?J?:                  ░                ░      \n");
			printf("             ░               ░          ░      .^!7!^7Y5P5YJJJ?!^.        ░      ░           ░             \n");
			printf("    ░               ░            ░        .^~~!?YYJ??JY55YJJJJJ?77~               ░         ░       ░      \n");
			printf("                         ░        ░     !JJYY555PGBGP55YJ?77!!!7?J?777^             ░            ░      ░  \n");
			printf("           ░     ░           ░         .^~J555555JGG55YJ7!!!77?JJJ?77!~^         ░           ░             \n");
			printf("       ░                             :???Y555P5YYPPYJ?7!~!7?JJ??77!!!7!^.       ░              ░      ░    \n");
			printf("              ░         ░       ░     .~7J5555YYJYPYYJ?7!!!7???7!!!7?J?7!!.           ░                    \n");
			printf("       ░          ░                .:^!JPPP55J!JYJJ??7777777!!!!7??77!~^.       ░           ░              \n");
			printf("  ░                 ░       ░      .!7JY5Y55Y?J5YJJ???77777!!!!!7??7!!~!7!^          ░                ░    \n");
			printf("                          ░       :7Y5YJYY?7JYJJ???777!!!!!!!777!~~~777!~.   ░                   ░         \n");
			printf("      ░       ░                ░    .!Y5YJ7?5YYYJJ???777!!!!!!!!!!!!!!!7!!~.        ░      ░               \n");
			printf("                       ░       .~JYYJ?Y5YYJ???777!!!!!!!!!!!!!!!!!!!~^:.       ░                ░      ░   \n");
			printf("       ░          ░       ░        .~J55YYYYJJ???777!!!!!!!!!!!!!!!!!!!~~~~~^:.        ░     ░             \n");
			printf("   ░            ░               .~7J5YYJJJJ???777777!!!!!!!!!!!~~~!!!!~~~~~~~~~~^:.                 ░      \n");
			printf("      ░                   .:7J55YYJJJ???77777777!!!!!!!!~~~~~~~!!~~~~~~~~~~~~~~~^:..░       ░          ░   \n");
			printf("        ░         ░   ░    :~?YYYYJJJ????77777!!!!!!!!!!!!~~~~~~~~~~~~~~~^^^^~~~~~~~~~~^:.      ░     ░    \n");
			printf("  ░           ░         .^?YYYJJJJJ????77777!!!!!!!!~~~~!!~~~~~~~~^~^^^^~^^^^^^~~~~~~~~!!~~^:.      ░      \n");
			printf("                   .^7JYYJJJ???????77777!!!!~~~~~~~~!~~~^^:::^~~~~~~~~~~~~~~~~~~~~~~~~~~!~~~~^::.    ░  ░  \n");
			printf("     ░     ░       :~7JYYJJJ??????77777777!!!!!!!!~~^^::...       .^~!!~~~~~~~~~~~~~~~~~~~~~~~!!!!!~~^^::  \n");
			printf("        ░    :~?JYYJJJJ?????7777777777!!!~!!~~^:.                 .^~!!!!~~~~~^~~~~~~~~~~~~~~!!!!!!!!!  ░  \n");
			printf("     ░  .:!?YYYYJJJ?????777777!!!!!!!!!!~~:.                        .:~!!!!~~~~^^^^^~~~~~~~~~~~!!!!!! ░    \n");
			arm = 0;
		}
		end = clock();
		pst = (double)(end - start) / CLK_TCK;
		if (pst >= 10) // 실행시간 10초지나면 팔씨름 종료
			break;
		else
		{
			c = getch(); // 계속 입력받아서 문자열 다음요소에 계속 저장되도록 함
			if (c == ' ') // 공백 상태일 경우에만
				space[i++] = c;
			sys_gotoxy(50, 24);
			printf("!!!%d!!!", i);
			Sleep(5);
		}
	}

	printf("%d\n", i);

	/*승패에 따른 결과 출력 및 캐릭터 스탯 변화*/
	if (i < winsize - (a->str * a->str) - 5) // 캐릭터 스탯 중 힘 스탯이 세면 셀수록 눌러야하는 연타량 대폭 감소
	{
		printf("패배");
		sys_printdot();
		if ((rand() % 2) == 0)
		{
			sys_print("마체테로 두들겨 맞아 체력이 2 감소했다...\n");
			a->hp -= 2;
		}
		else
		{
			printf("HASON GANG : ");
			sys_print("너 납치된거야\n");
			sys_print("50골드를 잃었다.");
			a->gold -= 50;
		}
	}
	else if ((i >= winsize - (a->str * a->str) - 5) && (i <= winsize - (a->str * a->str) + 5))
	{
		printf("무승부");
		sys_printdot();
		if ((rand() % 2) == 0)
		{
			sys_print("힘을 너무 많이 썼나...\n");
			sys_print("힘이 1 감소하였다...\n");
			a->str -= 1;
		}
		else
		{
			sys_print("그래도 운동이 됐는걸...?\n");
			sys_print("힘이 1 증가하였다...\n");
			a->str += 2;
		}
	}
	else if (i > winsize - (a->str * a->str) + 5)
	{
		printf("승리");
		sys_printdot();
		sys_print("상대방을 제압했다...\n");
		sys_print("지명수배범이었던 상대방을 제압하고 포상금 100골드를 수령했다...\n");
		sys_print("팔씨름을 하면서 팔도 2 정도 더욱 단단해진 기분이다.\n");
		a->gold += 100;
		a->str += 2;
	}

	free(space);
	sys_gonext();
}
